{
    "COMM1105": {
        "Title": "FWS: Action or Despair? Media Representations of Climate",
        "Course Code": "COMM1105",
        "Description": "\n            How we think about the climate crisis is shaped by the stories that various media tell us about our relationship with nature. From films such as The Day After Tomorrow and Elizabeth Kolbert's book Field Notes From a Catastrophe to Banksy's street art and news reports, we are presented with a vision of the future filled with despair and hopelessness. Do such messages work to raise awareness and drive change, or do they instill a sense of fatalism that prevents us from taking meaningful action? In this course we will think and write about how climate change is conceptualized and communicated in a range of assignments including critical interpretation of texts, a comparative analysis paper, a book or film review and a researched argument essay.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For more information about First-Year Writing Seminars, see the Knight Institute website at http://knight.as.cornell.edu/.\n",
        "Need Note": false
    },
    "COMM1106": {
        "Title": "FWS: Manufacturing Need: Writing About the Power of Advertising",
        "Course Code": "COMM1106",
        "Description": "\n            From Dove soap ads to Budweiser's famous Super Bowl commercials, companies vie for our attention in order to persuade us to buy their products. But what exactly are they selling us? This course will explore the ways in which print and video advertisements craft stories that capitalize on our best intentions and deepest anxieties. By identifying design elements such as use of color, lighting, spatial arrangement, music, and dialogue, students will assess and critique how visual ads make persuasive arguments that often work against our better judgment. We will then consider ads that harness this power to deliver positive messages through PSAs and advocacy advertising. Assignments will include rhetorical and critical analysis papers, creative briefs for a mock marketing campaign, and a video essay.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For more information about First-Year Writing Seminars, see the Knight Institute website at http://knight.as.cornell.edu/.\n",
        "Need Note": false
    },
    "COMM1300": {
        "Title": "Visual Communication",
        "Course Code": "COMM1300",
        "Description": "\n            Introduction to visual communication theory. Examines how visual images influence our attention, perspectives, and understanding. Constructs a visual analytic language for becoming visually aware and for thinking critically about how visual images influence us. Applies this language to visual artifacts such as photos, maps, comics, and graphs and considers how we communicate visually in various contexts (e.g., with our bodies, in scenes of strong emotion, and in human-built environments).\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication majors during pre-enroll, remaining seats will be available to others during add/drop.\n",
        "Need Note": false
    },
    "COMM2010": {
        "Title": "Oral Communication",
        "Course Code": "COMM2010",
        "Description": "\n            The course focuses on face-to-face, public communication, but the principles and practices addressed transfer to all purposeful communication situations. While many assume a good speech rests in how well it is delivered, students will learn that a good speech is equally dependent on the development, structure, and integrity of one's ideas. The objectives of the course are for students to speak effectively and ethically, and listen critically.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "ORL-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students must be fluent in spoken English.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment preference given to: communication majors and minors, CALS seniors, and CALS juniors.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication majors during pre-enroll, remaining available seats will be available to others during add/drop.\n",
        "Need Note": false
    },
    "COMM2200": {
        "Title": "Media Communication",
        "Course Code": "COMM2200",
        "Description": "\n            Introduction to media history, industry, content, policy, process, and effects.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "FA23",
            "SP23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM2310": {
        "Title": "Writing About Communication",
        "Course Code": "COMM2310",
        "Description": "\n            America's employers consistently rank the ability to communicate as one of the most important career skills for hiring and advancement. This course will strengthen your ability to craft effective written communication for a variety of formats, providing you with a skill set that is applicable in professional and academic settings. Assignments explore social science and communication concepts.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [
            [
                "COMM1101"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 1101 and 3 credits of college-level writing courses; summer only: grade of B or better in a 3-credit college writing course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Communication majors. All majors allowed for summer enrollment.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication majors. Prerequisite: 3 credits college level writing courses and COMM 1101.\n                  Enrollment limited to: Communication majors during pre-enroll, remaining available seats will be available to others during add/drop.\n",
        "Need Note": true
    },
    "COMM2760": {
        "Title": "Persuasion and Social Influence",
        "Course Code": "COMM2760",
        "Description": "\n            Social influence and persuasion are the most basic and important functions of communication. The course covers characteristics of persuasive messages, message sources, and targets; interpersonal influence; and influence in groups. Special emphasis is given to topics in health, science, risk. This course features interactive lectures, assignments that apply principles of persuasion to real world contexts, and an applied group research project. Exams, homework assignments, and the group research project comprise the bulk of student evaluation.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Not open to: graduate students. ",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM2820": {
        "Title": "Research Methods in Communication Studies",
        "Course Code": "COMM2820",
        "Description": "\n            Covers social scientific methods to solve communication research problems empirically. Topics include basic principles of social scientific research, random sampling, questionnaire design, experimental research design, focus group techniques, content analysis, and basic descriptive and inferential statistics. Students also learn basic data manipulation, presentation, and analysis techniques using SPSS and EXCEL.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores or higher.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication majors during pre-enroll, remaining available seats will be available to others during add/drop.\n",
        "Need Note": false
    },
    "COMM2850": {
        "Title": "Communication, Environment, Science, and Health",
        "Course Code": "COMM2850",
        "Description": "\n            Environmental problems, public health issues, scientific research-in each of these areas, communication plays a fundamental role. From the media to individual conversations, from technical journals to textbooks, from lab notes to the web, communication helps define scientifically based social issues and research findings. This course examines the institutional and intellectual contexts, processes, and practical constraints on communication in the sciences.\n        ",
        "Combined Course": [
            "STS2851"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM2990": {
        "Title": "Directed Research Experience",
        "Course Code": "COMM2990",
        "Description": "\n            Intended for first-year and sophomore students who are new to undergraduate research. Students may be reading scientific literature, learning research techniques, or assisting with ongoing research. The faculty supervisor determines the work goals and the form of the final report.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: Directed Research\n                          Students from all Colleges must submit a College of Agriculture and Life Sciences (CALS) Special Studies Form (https://cals.cornell.edu/undergraduate-students/student-services/academic-resources/special-studies-academic-policies-and-petitions-and-forms/undergraduate-special-studies-enrollment-non-structured-credit). Upon approval, students are responsible for enrolling themselves with a permission number.\n",
        "Need Note": false
    },
    "COMM3010": {
        "Title": "Writing and Producing the Narrative for Digital Media",
        "Course Code": "COMM3010",
        "Description": "\n            New media communication has been blurring the traditional roles of content creator and consumer. Professional communicators—such as journalists, screenwriters, advertising executives, documentarians, and podcasters—are now expected to know how to use alternative storytelling forms to reach their audiences. They need to know how to gather information through a variety of sources such as crowdsurfing and social media; quickly and efficiently write, edit, and record audio and video. This course will explore these new delivery systems and provide guided practice of emerging communication forms. Fundamentally, this course is about writing—concisely and accurately with a clear and active voice—for new digital media with a focus on the personal narrative.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores or above.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3030": {
        "Title": "Research Writing Seminar in Communication",
        "Course Code": "COMM3030",
        "Description": "\n            Academics are in the business of creating knowledge. The way that academics in the social sciences typically share the knowledge that we create—the way that most often earns us credit in our universities and among our professional community—is through our writing. In the field of communication, specifically, our writing typically takes the form of journal articles, which may be preceded by conference versions of our papers. At times, we also write book chapters, books, and book reviews; increasingly, scholars in our field may turn to other avenues of knowledge dissemination, including lay articles, blogs, social media, and the like (see Boczkowski & Delli Carpini (2020) for a rundown.\n        ",
        "Combined Course": [
            "COMM6730"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3040": {
        "Title": "Writing and Editing for Magazines and Online Media",
        "Course Code": "COMM3040",
        "Description": "\n            Introduction to magazine and online journalism, and how magazines and websites fit into the current media landscape. Through analytical and practical study of publications and the editorial process, students will gain a basic understanding of the range of writing and editing techniques required to be successful in the field.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "WRT-AG"
        ],
        "Prerequisites": [
            [
                "COMM2310"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2310.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3070": {
        "Title": "Communicating Today: Creating Strategic Visual Messages Across Media",
        "Course Code": "COMM3070",
        "Description": "\n            In many career fields, the ability to translate complex issues into compelling messages is an important professional skill. This requires knowledge of information gathering, message strategy and product selection. In this course, students pick a topic of personal interest and create strategic communication using four of the following popular traditional and multimedia formats: press release, fact sheet, blog, webpage, news story, op-editorial, audio slideshow, short video. Research continues through the semester as needs for facts and colorful content are identified with each product. Students learn effective use of data, narrative, commentary, storytelling, images, and message enhancement. Students are encouraged, but not required, to select topics related to science or sustainability. Class covers communicating about hot-button issues, such as climate change. Instructor will help students identify venues for publications.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AG"
        ],
        "Prerequisites": [
            [
                "COMM2310",
                "COMM2010"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2310 or COMM 2010 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication majors during pre-enroll, remaining available seats will be available to others during add/drop.\n",
        "Need Note": false
    },
    "COMM3100": {
        "Title": "Communication and Decision Making in Groups",
        "Course Code": "COMM3100",
        "Description": "\n            Provides students with a greater understanding of information sharing, persuasion, and decision development in small work groups. Through practical exercises, class discussions, and lectures, students learn firsthand how tools such as decision structuring process can affect group performance. The course is taught in an interactive hands-on format that emphasizes application of tested theory.  Due to the unique nature of this class, there is a very strict attendance policy. \n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2760"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2760.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: juniors or seniors. Priority given to: COMM majors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3110": {
        "Title": "Educational Psychology",
        "Course Code": "COMM3110",
        "Description": "\n            Educational psychology is the application of psychological principles and concepts to cases of teaching and learning. We study behavioral, cognitive, embodied, and social-cultural perspectives on learning and thinking, and we use them in planning and reflecting on weekly fieldwork outside the classroom. In the process, we become more mindful and skilled learners ourselves and better facilitators of others' learning.\n        ",
        "Combined Course": [
            "EDUC3110",
            "HD3110"
        ],
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "CA-AG",
            "KCM-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores, juniors, and seniors.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment preference given to: upperclassmen completing the Education Minor.\n",
        "Need Note": false
    },
    "COMM3200": {
        "Title": "Technology, Behavior and Society",
        "Course Code": "COMM3200",
        "Description": "\n            This course addresses the contemporary socio- technological challenges and debates about digital media and information technologies and their impact on society. It covers a broad spectrum of topics spanning digital technologies, social behaviors, and society. We will critically evaluate research evidence and its relevance to various social contexts and practices, diverse users and uses of social media, ethical and policy implications, trade-offs of potential solutions, and the impact of socio-technological shifts on individuals and communities. Our overarching goal is to challenge commonplace assumptions about these tools and phenomena; and to ask deeper questions about their profound impact on society.\n        ",
        "Combined Course": [
            "INFO3200"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3250": {
        "Title": "Vamos Pa'l Norte: U.S. Migration and Communication",
        "Course Code": "COMM3250",
        "Description": "\n            Migrants are a heterogeneous group of people (the term \"migrants\" is used to encompass different immigrant communities). The reasons for relocating to the United States, or another country, the conditions under which they relocate, whether they are authorized to remain in a country, their cultural backgrounds, their ethnic/racial identities, their education level, their gender identity and sexual orientation, and their socio-economic status are merely a few factors that contribute to immigrants' diverse experiences. Thus, this course will introduce us to different frameworks, research, and practices that can help us understand the important role of communication in different, U.S., migration experiences. On the one hand, communication can help mitigate some of the social and structural barriers that migrants face in the United States and elsewhere. On the other hand, communication can also exacerbate or lead to educational, economic, and health inequities among migrants. We will consider both ways in which communication can function for migrant communities. Overall, migration: (1) is a diverse area of research that can incorporate intrapersonal, interpersonal, community, organizational, institutional, cultural, and policy levels of analysis; (2) is studied using a wide range of methodologies; and (3) is affected by a variety of communication channels. The readings and content of this course primarily focus on the experiences of Latina/o/x immigrant communities in the U.S.\n        ",
        "Combined Course": [
            "LSP3250"
        ],
        "Semester Offered": [
            "SP25",
            "FA23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "D-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3760": {
        "Title": "Planning Communication Campaigns",
        "Course Code": "COMM3760",
        "Description": "\n            Provides a theoretical and practical overview of the audiences, messages, and evaluation of communication campaigns. The course considers common methods of data collection (e.g. in-depth interviews, surveys) and analysis of campaign-related data sources. Specific topics include: (1) campaign goals, objectives, strategies, and tactics; (2) research design and implementation; (3) audience segmentation; (4) message construction; and (5) techniques of evaluation.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [
            [
                "COMM2820"
            ]
        ],
        "Specific Requirements": "Prerequisite or corequisite: COMM 2820 or equivalent research methods course, and a course in basic statistics.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "COMM3800": {
        "Title": "Television in the Digital Age",
        "Course Code": "COMM3800",
        "Description": "\n            What is television? Drawing on key concepts in the field of television studies, this class will critically appraise the medium of television in our contemporary digital context. We will look at transformations in television production, genres, and audiences in response to new technologies and economies. By the end of the class, we will decide whether \"television\" is still a meaningful term and, if so, how its meanings must expand to account for our changing televisual practices. By the end of the course, you will have deepened your understanding of television and its relation to contemporary culture as well as developed a scholarly understanding of some key ideas that have structured television studies since its emergence as a field of study in the mid-1970s.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "HA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2200"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2200.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Prerequisite: COMM 2200.\n",
        "Need Note": false
    },
    "COMM4292": {
        "Title": "Sexual Identities and the Media",
        "Course Code": "COMM4292",
        "Description": "\n            This class moves beyond a simple consideration of how lesbians, gays, bisexuals, transgender and queer people have been represented in the mainstream media. We will explore both how dominant media forms have traditionally represented LGBTQ people, as well as how LGBTQ people have seized the opportunities offered by alternative media practices and technologies to articulate passions and politics that dominant media forms have little or no investment in.\n        ",
        "Combined Course": [
            "FGSS4292"
        ],
        "Semester Offered": [
            "SP25",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "D-AG",
            "LA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4350": {
        "Title": "Communicating Leadership and Ethics",
        "Course Code": "COMM4350",
        "Description": "\n            Leadership development in a changing technological world presents new challenges. Digital and evolving technologies allow new and creative forms of communication, collaboration and teamwork with increasingly globally located and diverse team members who may work remotely and asynchronously to coordinate information and achieve shared goals. These, along with newer forms of organizational structure and culture and require leaders who lead with integrity and a mind toward creating ethical contexts and communication practices. This course uses discussion, reflective activities, current events, case studies, online interactions, and guest speakers to develop one's own future leadership skills and to communicate leadership ethically and effectively.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AG",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: junior or senior standing.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment preference given to: Communication majors and/or Leadership minors who have taken LEAD 3100.",
        "Foot Note": "\nInstruction Mode: Online\n",
        "Need Note": true
    },
    "COMM4360": {
        "Title": "Communication Networks and Social Capital",
        "Course Code": "COMM4360",
        "Description": "\n            Course covers the relationship between communication networks and social capital and explores the tension between individual and group capital.\n        ",
        "Combined Course": [
            "INFO4360"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2450",
                "INFO2450",
                "INFO2040"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2450/INFO 2450 or INFO 2040.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4380": {
        "Title": "Communication in Virtual Worlds",
        "Course Code": "COMM4380",
        "Description": "\n            This course deals with the psychological, social, and technical aspects of being embodied in virtual environments. During this course, students will learn how human—and non-human—entities and their actions are represented as virtual bodies. The course is organized around three areas: an overview of how a sense of embodiment is created in virtual reality, an overview of research on virtual embodiment, and current and future applications. Students will experience virtual environments, relate course topics to current events, and experiment with the creation of immersive virtual content.\n        ",
        "Combined Course": [
            "COMM5380"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Primarily for: juniors and seniors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4400": {
        "Title": "Qualitative User Research and Design Methods",
        "Course Code": "COMM4400",
        "Description": "\n            This upper-level course provides an in-depth understanding of and experience with advanced concepts and techniques for researching, ideating, critiquing, designing, prototyping, and evaluating interactive technologies intended for people to use and incorporate in their lives. The course focuses on advanced user research and design methods.\n        ",
        "Combined Course": [
            "INFO4400",
            "INFO5400",
            "INFO6400"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM3450",
                "INFO3450",
                "INFO5355"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 3450/INFO 3450/INFO 5355 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4450": {
        "Title": "Computer-Mediated Communication",
        "Course Code": "COMM4450",
        "Description": "\n            Focuses on reading and evaluating the theories and research methodologies used to investigate communication via computer systems. Assignments include student collaborations using electronic conferencing and other advanced communication technologies, as well as reflections on and evaluations of these collaborations in light of current theories and research findings. Topics include virtual teams, videoconferencing, and others as they emerge.\n        ",
        "Combined Course": [
            "COMM6450",
            "INFO4450",
            "INFO5450",
            "INFO6450"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4660": {
        "Title": "Public Communication of Science and Technology",
        "Course Code": "COMM4660",
        "Description": "\n            Explores the structure, meanings, and implications of \"public communication of science and technology\" (PCST). Examines the contexts in which PCST occurs, looks at motivations and constraints of those involved in producing information about science for nonprofessional audiences, and analyzes the functions of PCST. Ties existing ideas about PCST to general communication research and leads to developing new knowledge about PCST.\n        ",
        "Combined Course": [
            "STS4661"
        ],
        "Semester Offered": [
            "SP25",
            "SP24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2850",
                "ENGRC3500"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2850 or ENGRC 3500, or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "COMM4760": {
        "Title": "Population Health Communication",
        "Course Code": "COMM4760",
        "Description": "\n            This senior-level undergraduate seminar provides an overview of theory and research on communication related to population health, including strategic efforts to impact health behavior and structural environments that support health, media portrayals of health issues, and news coverage of health and social policy with impacts on the health and distribution of health in populations. Topics include: theories of behavior change and message effects, campaigns to improve behavioral and structural determinants of health, the intersection of health and politics, and implications of changes in media platforms for population health campaigns and research.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2820"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2820.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: seniors and juniors, sophomores by permission of instructor.\n",
        "Need Note": false
    },
    "COMM4940": {
        "Title": "Special Topics in Communication",
        "Course Code": "COMM4940",
        "Description": "\n            Study of topics in communication not otherwise provided by a department course and determined by the interest of faculty members and students. Please check department website for most up-to-date offerings.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4960": {
        "Title": "Communication Internship",
        "Course Code": "COMM4960",
        "Description": "\n            Students receive a structured, on-the-job learning experience under the supervision of communication professionals in cooperating organizations. A minimum of 60 hours of on-the-job work is required; the number of work hours beyond 60 is left to the discretion of the intern and the supervising company. A final project linking communication theory to practical work experience is required. All internships must be approved by the internship coordinator before the work experience segment. All COMM 4960 internship courses must adhere to the CALS guidelines at cals.cornell.edu/academics/student-research/internship. For more information about registering for credit and COMM 4960, please see https://communication.cals.cornell.edu/undergraduate-program/internship-information-0. \n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Work component and variable. Minimum 60 hours. May be repeated for credit.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: COMM majors or minors.",
        "Foot Note": "\nInstruction Mode: Independent Studies\n                          Enrollment limited to: Communication majors or minors.\n",
        "Need Note": false
    },
    "COMM4970": {
        "Title": "Individual Study in Communication",
        "Course Code": "COMM4970",
        "Description": "\n            Individual study under faculty supervision. Work should concentrate on locating, assimilating, synthesizing, and reporting existing knowledge on a selected topic. Attempts to implement this knowledge in a practical application are desirable.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students must register using CALS Special Studies form available online. Maximum of 3 credits can be applied to major credits. May be repeated for credit.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores, juniors and seniors with a 3.0 GPA.",
        "Foot Note": "\nInstruction Mode: Independent Studies\n                          Prerequisite: 3.0 GPA.\n                  Students from all Colleges must submit a College of Agriculture and Life Sciences (CALS) Special Studies Form (https://cals.cornell.edu/undergraduate-students/student-services/academic-resources/special-studies-academic-policies-and-petitions-and-forms/undergraduate-special-studies-enrollment-non-structured-credit). Upon approval, students are responsible for enrolling themselves with a permission number.\n",
        "Need Note": false
    },
    "COMM4980": {
        "Title": "Communication Teaching Experience",
        "Course Code": "COMM4980",
        "Description": "\n            Periodic meetings with the instructor cover realization of course objectives, evaluation of teaching methods, and student feedback. In addition to aiding with the actual instruction, each student prepares a paper on some aspect of the course.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: juniors or seniors with a 3.0 GPA (2.7 if teaching assistant for skills development course). Intended for: undergraduates desiring classroom teaching experience.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4990": {
        "Title": "Independent Research",
        "Course Code": "COMM4990",
        "Description": "\n            Permits outstanding students to conduct laboratory or field research in communication under appropriate faculty supervision. The research should be scientific: systematic, controlled, empirical. Research goals should include description, prediction, explanation, or policy orientation and should generate new knowledge.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students must register using CALS Special Studies form available online. Maximum of 3 credits can be applied to major requirements. May be repeated for credit.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: juniors and seniors with a 3.0 GPA.",
        "Foot Note": "\nInstruction Mode: Directed Research\n                          Prerequisite: 3.0 GPA. Enrollment limited to: seniors and juniors.\n                  Students from all Colleges must submit a College of Agriculture and Life Sciences (CALS) Special Studies Form (https://cals.cornell.edu/undergraduate-students/student-services/academic-resources/special-studies-academic-policies-and-petitions-and-forms/undergraduate-special-studies-enrollment-non-structured-credit). Upon approval, students are responsible for enrolling themselves with a permission number.\n",
        "Need Note": false
    },
    "COMM5380": {
        "Title": "Communication in Virtual Worlds",
        "Course Code": "COMM5380",
        "Description": "\n            This course deals with the psychological, social, and technical aspects of being embodied in virtual environments. During this course, students will learn how human—and non-human—entities and their actions are represented as virtual bodies. The course is organized around three areas: an overview of how a sense of embodiment is created in virtual reality, an overview of research on virtual embodiment, and current and future applications. Students will experience virtual environments, relate course topics to current events, and experiment with the creation of immersive virtual content.\n        ",
        "Combined Course": [
            "COMM4380"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM5660": {
        "Title": "Science Communication Workshop",
        "Course Code": "COMM5660",
        "Description": "\n            This weekend workshop trains researchers in the sciences (including natural sciences, engineering, experimental social sciences, etc.) to communicate effectively with nonscientists such as policy makers, political stakeholders, the media, and the general public. Training activities may include role-play, reading/discussion, writing press releases and other outreach materials, and discussion with invited speakers.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "SP22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: graduate students.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM1101": {
        "Title": "Introduction to Communication",
        "Course Code": "COMM1101",
        "Description": "\n            This course will provide an introduction to the study of Communication. Topics include the functions, foundations, models, and modes of communication. Students will be introduced to research methods and begin to master the research and study skills required to be a successful scholar of communication. An overview of concepts and processes related to the functions of communication will be examined through current theoretical and empirical research.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM1111": {
        "Title": "Navigating the Communication Major and Beyond",
        "Course Code": "COMM1111",
        "Description": "\n            This course introduces the Communication major and focuses on transitioning to college life, developing your academic identity, and making meaning of your college experience. You will develop a learning community, identify your support network, and explore what Cornell offers to you as a first-year Communication student. Course content will promote the development of skills for balancing academic success with extracurricular and interpersonal activities during your time in the major.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Required for and limited to: first-year Communication majors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM1180": {
        "Title": "Leading by Mentoring: Being a COMM-Unity Mentor",
        "Course Code": "COMM1180",
        "Description": "\n            You should take this course if you have accepted an invitation to be a COMM-Unity Project (CUP) Peer Mentor, a fall semester commitment. As a peer mentor in COMM 1180, you will build your mentoring and leadership skills as you mentor first-year underrepresented minority and first-generation undergraduate COMM students. These skills include listening and responding empathetically to student concerns; helping students to identify and find resources for their needs; modeling good study and time management skills; communicating effectively; reflecting on experiences; and articulating goals. This weekly one-hour, one-unit course will give you an opportunity to learn about resources on campus and to talk with other peer mentors about successes and challenges.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Required for and limited to: Communication majors who have been selected as peer mentors for the COMM-Unity Project (CUP) Peer Mentorship Program.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment required for and limited to: Communication majors who have been selected as peer mentors for the COMM-Unity Project (CUP) Peer Mentorship Program.\n",
        "Need Note": false
    },
    "COMM2450": {
        "Title": "Communication and Technology",
        "Course Code": "COMM2450",
        "Description": "\n            Introduces students to the Communication and Information Technologies focus area of the communication department and the Human Systems track for information science. It examines several approaches to understanding technology and its role in human behavior and society. Topics include psychological aspects of computer-mediated communication; how design plays a role in the way we interface with technology and collaborate with each other; and the ways in which communication technology is situated inside social and institutional structures and cultural formations.\n        ",
        "Combined Course": [
            "INFO2450"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3020": {
        "Title": "Science Writing for the Media",
        "Course Code": "COMM3020",
        "Description": "\n            How to write about science, technology, and medicine for the media. Writing assignments focus on writing news for web sites, blogs, magazines, and other media.\n        ",
        "Combined Course": [
            "STS3020"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG",
            "WRT-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: completion at least one college-level writing course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores or higher.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "COMM3050": {
        "Title": "Advanced Media Writing about Cultural, Social, and Environmental Crises",
        "Course Code": "COMM3050",
        "Description": "\n            This advance writing course will tackle today's top cultural issues, such as climate change, social justice, social media, political extremism and others, with the ultimate goal of student publication. Students will first research a media market of their choice, preferably their home market, and then create compelling media content for identified local or regional media outlets. The media content will focus on the local or regional impacts of national or global cultural crises to highlight the impact on communities. A hoped-for, but not required, outcome of the course is for students to get one piece published in their target market. Students must have strong writing skills, be self-disciplined about making deadlines, be proactive and have an interest in publishing. Advanced media writing, op-editorial, and creative non-fiction will be covered.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "WRT-AG"
        ],
        "Prerequisites": [
            [
                "COMM2310"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: an A- or better in COMM 2310 or equivalent course, experience with media writing and/or strong writing skills.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "COMM3065": {
        "Title": "Sports Communication: Media, Marketing, Crisis and Violence",
        "Course Code": "COMM3065",
        "Description": "\n            This course will introduce the student to various aspects of the sports-media-audience relationship, including the history of sports and the media, the industries that constitute sports media, the audiences drawn to and affected by sports media, and the social issues that arise from sports media. It will organized around three modules: Industry, Issues & Careers.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3140": {
        "Title": "Political Journalism",
        "Course Code": "COMM3140",
        "Description": "\n            This course will explore the traditional dynamic and norms of political press coverage in the United States, and the impact of those patterns on both the government and the nation; some of the ways longstanding norms have recently shifted, and continue to shift; the larger historical forces and long-term trends driving those changes; and the theoretical questions, logistical challenges and ethical dilemmas these changes pose for both political journalists and those they cover. The course will equally cover the practice of political reporting, including weekly analysis and discussion of current press coverage, in-class exercises and simulations, readings from academic and journalistic sources, and visits from leading political reporters and former spokespeople able to offer a firsthand perspective on the topics.\n        ",
        "Combined Course": [
            "AMST3145",
            "ENGL3941",
            "GOVT3221",
            "PUBPOL3140",
            "PUBPOL5140"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "SP23"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3189": {
        "Title": "Taking America's Pulse: Creating and Conducting a National Opinion Poll",
        "Course Code": "COMM3189",
        "Description": "\n            In this course, students will design, conduct, and analyze a national-level public opinion survey. Students will determine all survey questions based on their research interests. All necessary survey research skills will be learned in the class.\n        ",
        "Combined Course": [
            "GOVT3189"
        ],
        "Semester Offered": [
            "FA24"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "OPHLS-AG",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3210": {
        "Title": "Communication and the Environment",
        "Course Code": "COMM3210",
        "Description": "\n            Students investigate how values, attitudes, social structure, and communication affect public perceptions of environmental risk and public opinion about the environment. A primary focus is mass media's impact on public perceptions of the environment, how the media portray the environment, and discussion of the implications of public consumption of environmental content.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3450": {
        "Title": "Human-Computer Interaction Design",
        "Course Code": "COMM3450",
        "Description": "\n            This course focuses on user experience design (UX) and the life cycle of interface design from the user perspective. We will discuss key aspects of the human-centered design process: understanding, analyzing, and formalizing user needs, exploring possible design solutions to address user needs, creating prototypes to externalize design ideas, and evaluating the usability of these prototypes.\n        ",
        "Combined Course": [
            "INFO3450",
            "INFO5355"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Communication (COMM) majors.\n",
        "Need Note": false
    },
    "COMM4260": {
        "Title": "Gender and Media",
        "Course Code": "COMM4260",
        "Description": "\n            This seminar addresses the intersection of communication, culture, and identity through an examination of gender and the U.S. media system. After introducing students to key approaches to studying gender and mediated communication, the course will cover topics in four subunits: (1). Mediated representations of gender, sexuality, and intersectionality; (2). Diversity in media industries and gendered labor markets; (3). Gendered audiences and fan cultures; and (4). Gender, power, and identity in a digital era of communication. We will explore these topics through literature from sociology, communication and media studies, cultural studies, feminist theory, and internet/new media studies.\n        ",
        "Combined Course": [
            "FGSS4260"
        ],
        "Semester Offered": [
            "FA24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "D-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4300": {
        "Title": "Ethics in New Media, Technology, and Communication",
        "Course Code": "COMM4300",
        "Description": "\n            This course examines moral and ethical issues in communication, new media, and technology. Using theories and research in moral philosophy and psychology, we examine how people perceive and reason about ethical issues presented by media and technology, and how moral action is influenced by cognitive, emotional, and ethical belief systems. Issues of autonomy, transparency, harm, privacy, manipulation, justice, democracy, equality, and care are discussed. We analyze the consistency between personal and professional ethics, the importance of moral character and agency, and the translation of moral thought to ethical action, and address the development of professional and personal ethical codes of conduct and research for communication professionals in the areas of new media and technology.\n        ",
        "Combined Course": [
            "COMM5300",
            "INFO4301",
            "INFO5301"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Credit hours reflect an intermission midway through each class period.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: graduate students and seniors; others by permission as space allows.\n",
        "Need Note": false
    },
    "COMM4500": {
        "Title": "Language and Technology",
        "Course Code": "COMM4500",
        "Description": "\n            Examines how new communication technologies affect the way we produce and understand language and modify interaction with one another. Focuses on the collaborative nature of language use and how Internet technologies affect the joint activities of speakers and listeners during the construction of meaning in conversation\n        ",
        "Combined Course": [
            "COMM6500",
            "INFO4500",
            "INFO6500"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2450",
                "INFO2450"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2450/INFO 2450 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4950": {
        "Title": "Communication Industries: NYComm",
        "Course Code": "COMM4950",
        "Description": "\n            This seminar will introduce students to the world of professional communication. Students will meet communication alumni working in media, technology, public relations, advertising, brand management, marketing, and civil service. Students will learn about alumni roles in the changing the professional communication landscape. Students will create a resume and learn interview skills, in addition to preparing an ePortfolio. At the end of the 7-week seminar, students will travel to New York City for three days to meet with alumni working in the communication fields. Previous companies visited include: Nintendo, NBCUniversal, Social Code, M Booth, AMC, OXO and the United Nations' Youth Global Leadership Foundation. The course will cover relevant background information about each company prior to the trip and will include Skype meetings with other communication and media firms before the trip to NYC, which occurs the week after Cornell's Fall Break.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            1.5
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Communication majors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM5300": {
        "Title": "Ethics in New Media, Technology, and Communication",
        "Course Code": "COMM5300",
        "Description": "\n            This course examines moral and ethical issues in communication, new media, and technology. Using theories and research in moral philosophy and psychology, we examine how people perceive and reason about ethical issues presented by media and technology, and how moral action is influenced by cognitive, emotional, and ethical belief systems. Issues of autonomy, transparency, harm, privacy, manipulation, justice, democracy, equality, and care are discussed. We analyze the consistency between personal and professional ethics, the importance of moral character and agency, and the translation of moral thought to ethical action, and address the development of professional and personal ethical codes of conduct and research for communication professionals in the areas of new media and technology.\n        ",
        "Combined Course": [
            "COMM4300",
            "INFO4301",
            "INFO5301"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Credit hours reflect an intermission midway through each class period.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: graduate students and seniors; others by permission as space allows.\n",
        "Need Note": false
    },
    "COMM4860": {
        "Title": "Risk Communication",
        "Course Code": "COMM4860",
        "Description": "\n            Every day we face known and unknown risks to our own health and safety and risks to the environment. In many cases we not only misperceive these risks, but we frequently make decisions that put us at even greater risk. Communicating the likelihood of harm based on complex, incomplete, and uncertain science is a challenge. This course uses case studies to illustrate theories of risk communication, and practical in-class exercises to demonstrate how theories apply to specific situations.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3081": {
        "Title": "Environmental and Sustainability Communication Part II",
        "Course Code": "COMM3081",
        "Description": "\n            This course is the 2nd half of COMM 3080. Combined, the courses are designed to provide you with an in-depth opportunity to apply insights from environmental and sustainability communication to real-world settings, to help achieve strategic outcomes regarding some of the most pressing challenges of our time. Following an overview of relevant communication theory and principles, the course will feature visitors and guest speakers from our partner environmental organizations (both local and national) to discuss their specific communication goals around environmental and sustainability topics and their strategies for achieving them. A major focus of the class will be on critically engaging with these goals and strategies from a perspective informed by the field of communication—through a mixture of short assignments, case studies, and ultimately, a summer-long internship with one of our partner organizations in Summer—culminating with student presentations in the Fall semester.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23",
            "FA22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM3080"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 3080.",
        "Comments": "Note that this course is supported by a grant from Engaged Cornell, an initiative that seeks to foster community engagement and emphasizes \"knowledge with a purpose.\" As such, our major goal in this course is to blend insights from the scientific study of environmental and sustainability communication with the strategic communication goals of our partner environmental organizations to create more creative, informed, and effective public engagement. The grade recorded at the end of the second semester (COMM 3081) evaluates the student's performance in the course for the entire year.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Prerequisite: COMM 3080. This is the second half of a year long course. In Spring students enroll in COMM 3080 and for Fall they are enrolled in COMM 3081.\n",
        "Need Note": false
    },
    "COMM3150": {
        "Title": "Organizational Communication: Theory and Practice",
        "Course Code": "COMM3150",
        "Description": "\n            This is a survey course of issues that influence communication in organizations.  Topics include formal organizational structure, social networks, information technology, leadership, team dynamics, and cross-culture differences.\n        ",
        "Combined Course": [
            "COMM5150"
        ],
        "Semester Offered": [
            "FA23",
            "SP23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3730": {
        "Title": "Mindful Intercultural Communication",
        "Course Code": "COMM3730",
        "Description": "\n            In this course, students will read theories and research in positive psychology, mindfulness meditation, and intercultural communication to gain a basic understanding of the emerging science on the effects of mindfulness practices on effectiveness in intercultural communication, as well as mental and physical health. Students will also learn a series of meditative routines, including both basic breathing techniques and more advanced meditative practices that conscientiously cultivate such positive emotions as gratitude, joy, compassion, empathy, equanimity, forgiveness and connectedness of humanity. Through regular and persistent practices, students will grow their attentiveness, compassion, and empathy that are vital for constructive intercultural and interpersonal communication.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4951": {
        "Title": "Communication Industries: CaliCOMM",
        "Course Code": "COMM4951",
        "Description": "\n            This fall semester seminar introduces students to the world of professional communication. Students meet communication alumni working in media, technology, public relations, brand management, marketing, and civil services. Students learn about alumnis' roles in the changing professional communication landscape. Students create a resume and learn interview skills, in addition to preparing an ePortfolio. In preparation for a required trip to visit companies in California, the course will cover relevant background information about each company and will include Skype meetings with other communication and media firms.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23",
            "FA22"
        ],
        "Credits": [
            0.5
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Communication majors.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Fall graduating seniors are not eligible to enroll.\n                  Students are required to enroll in COMM 4952 during Winter to be part of a trip to California; details of the trip, expenses, etc. can be found here: https://cals.cornell.edu/communication/undergraduate/undergraduate-opportunities/nycomm-calicomm\n",
        "Need Note": false
    },
    "COMM5150": {
        "Title": "Organizational Communication: Theory and Practice",
        "Course Code": "COMM5150",
        "Description": "\n            This is a survey course of issues that influence communication in organizations.  Topics include formal organizational structure, social networks, information technology, leadership, team dynamics, and cross-culture differences.\n        ",
        "Combined Course": [
            "COMM3150"
        ],
        "Semester Offered": [
            "FA23",
            "SP23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM3080": {
        "Title": "Capstone Course in Environmental and Sustainability Communication: From the Lab to the World",
        "Course Code": "COMM3080",
        "Description": "\n            This Capstone course in Environmental and Sustainability communication bridges students' understanding of communication theory with a spring seminar and summer internship focused on the communication goals of our partner environmental organizations. Class meetings will involve a mix of lecture, readings, activities, case studies, and guest visits from local and national environmental organizations, focused on understanding and addressing communications challenges common to the field as well as those specific to individual organizations.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP23",
            "SP22"
        ],
        "Credits": [
            2.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: one theory and one practice course related to environmental communication, which can be taken prior to, or concurrently, with seminar.",
        "Comments": "This seminar is a required course for a new engaged learning \"track\" and students will be matched with an organizational partner for a paid summer internship. Students must enroll in both COMM 3080 (spring) and COMM 3081 (fall) to receive a final letter grade. Contact professors for more information.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For more information about the class, please visit: https://cals.cornell.edu/communication/undergraduate/undergraduate-opportunities/undergraduate-fellowships. The application can be found here: https://app.smartsheet.com/b/form/b6949b3fb2634cd6b9cd5a135eda2806\n",
        "Need Note": true
    },
    "COMM4220": {
        "Title": "Psychology of Entertainment Media",
        "Course Code": "COMM4220",
        "Description": "\n            Every media format uses entertainment, including video games, advertising, television, movies, sports, and news. This course examines the psychology (conscious and unconscious) of entertainment, including why people like entertainment, what makes a story entertaining, how people mentally process entertainment, what makes things frightening or funny, and whether or not entertainment can persuade.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM1101",
                "COMM2200"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: introductory psychology or COMM 1101 or COMM 2200.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: Distance Learning-Synchronous\n                          Prerequisite: introductory psychology or COMM 1101 or COMM 2200.\n",
        "Need Note": false
    },
    "COMM1120": {
        "Title": "Wonder Women",
        "Course Code": "COMM1120",
        "Description": "\n            This course brings together students, faculty, and invited guests to discuss the art of leadership and the opportunities and challenges women in leadership roles have encountered in their careers and how they have managed them. The sessions will be held in North Campus faculty residences and will feature prominent women from different professions and walks of life. Potential speakers include politicians; artists; writers; scientists; women in spiritual life; and business owners and entrepreneurs. Speakers will share their stories with students in an informal way, opening up faculty-facilitated discussions about gender, leadership, accomplishment, work-life balance, and mentorship. These talks may be interspersed with or supplemented by reading and discussion of recent writing on women and leadership.            \n        ",
        "Combined Course": [
            "FGSS1120",
            "GDEV1120",
            "UNILWYL1120"
        ],
        "Semester Offered": [
            "FA22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "This is a Learning Where you Live course. Does not count for Comm major or minor.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          This is a Learning Where You Live course. Primarily for: first-year students.\n",
        "Need Note": false
    },
    "COMM3710": {
        "Title": "Crossing Cultures Through Film",
        "Course Code": "COMM3710",
        "Description": "\n            The goal of the class is to expose students to cross-cultural differences in a wide range of topics, ranging from ethnicity and race, values, religion, ethics, gender, sexual orientation to behavioral norms. Throughout the semester, students will examine and analyze these issues through a selection of films that offer vivid portrayals of how people from across the world live and work. Through in-class discussion of these films, along with assigned readings, the course aims to help students gain cross-cultural competence in cognition, affect and behavior.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG",
            "D-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "This course will count for the Persuasion and Social Influence (CSI) and Communication Media Studies (CMS) focus areas for Communication majors; Communication majors must take the course for a letter grade.  ",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4201": {
        "Title": "Information Policy: Applied Research and Analysis",
        "Course Code": "COMM4201",
        "Description": "\n            This course will address a wide range of information policy issues such as privacy, security, antitrust, intellectual property, algorithmic fairness, net neutrality, risk mitigation strategies, and other legal and policy compliance concerns in a simulated project management environment. Patterned on life cycle project management for products and services in contemporary large-scale technology companies, students will adopt specific topic areas for applied research and analysis working dynamically with other team members. Course outcomes include conducting upper-level research in specific information policy domains, experiential group dynamics, persuasive analytic presentations, fundamentals of project management in the technology sector, and insights into corporate hierarchies, organization, and functionalities.\n        ",
        "Combined Course": [
            "INFO4200",
            "INFO5200",
            "STS4200"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO1200",
                "INFO1260"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1200 or INFO 1260.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4490": {
        "Title": "Social Behavior and Technology",
        "Course Code": "COMM4490",
        "Description": "\n            This course explores personal connections in the digital age, and how information and communication technologies impact our lives and relationships. It focuses on how people manage interactions and identities, develop and maintain relationships, accomplish social goals, create shared meanings, and engage in collaboration and conflict in social media. Emphasis will be placed on how current thinking in relational communication can explain and anticipate interpersonal dynamics on the Internet, but also on how online behaviors may challenge traditional principles of human communication. A major part of the course is a semester-long research project in which students working in small groups design, run, and present their own empirical study of personal relationships and technology.\n        ",
        "Combined Course": [
            "COMM6490",
            "INFO4490",
            "INFO6490"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "INFO2450"
            ],
            [
                "COMM2450"
            ],
            [
                "COMM2820"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2820, COMM 2450 and INFO 2450.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "COMM4800": {
        "Title": "Behavioral Science Interventions",
        "Course Code": "COMM4800",
        "Description": "\n            \"There is nothing as practical as a good theory,\" Kurt Lewin wrote. Today behavioral scientists build on social scientific theories about human behavior to develop new intervention approaches that address major challenges facing our society: poverty, poor health, educational inequalities, and many more. This course is designed as a senior capstone seminar that equips students with the knowledge and skills to analyze social problems, consider the ethical implications of intervention, design and pilot appropriate interventions, implement and test them online, analyze and interpret the results, and present policy-relevant findings. The course combines applied quantitative research methods and applied social behavioral science theories to prepare students for careers in research, data science, consulting, and policy evaluation.\n        ",
        "Combined Course": [
            "COMM5800",
            "INFO4800",
            "INFO5800"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AG",
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2760",
                "INFO2450",
                "PSYCH2800"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2760 or INFO 2450 or PSYCH 2800 or approved introductory social science theory course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Students need to submit an application to be enrolled into the class. The application form for Spring 2022 can be found here: https://cornell.ca1.qualtrics.com/jfe/form/SV_bDUr0KcN2D8DjcV. Those who are selected will receive a permission code from the instructor to add the course in Student Center. Please contact Professor Kizilcec (kizilcec@cornell.edu) for any questions.\n",
        "Need Note": false
    },
    "COMM5800": {
        "Title": "Behavioral Science Interventions",
        "Course Code": "COMM5800",
        "Description": "\n            \"There is nothing as practical as a good theory,\" Kurt Lewin wrote. Today behavioral scientists build on social scientific theories about human behavior to develop new intervention approaches that address major challenges facing our society: poverty, poor health, educational inequalities, and many more. This course is designed as a senior capstone seminar that equips students with the knowledge and skills to analyze social problems, consider the ethical implications of intervention, design and pilot appropriate interventions, implement and test them online, analyze and interpret the results, and present policy-relevant findings. The course combines applied quantitative research methods and applied social behavioral science theories to prepare students for careers in research, data science, consulting, and policy evaluation.\n        ",
        "Combined Course": [
            "COMM4800",
            "INFO4800",
            "INFO5800"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM2760",
                "INFO2450",
                "PSYCH2800"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2760 or INFO 2450 or PSYCH 2800 or approved introductory social science theory course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Students need to submit an application to be enrolled into the class. The application form for Spring 2022 can be found here: https://cornell.ca1.qualtrics.com/jfe/form/SV_bDUr0KcN2D8DjcV. Those who are selected will receive a permission code from the instructor to add the course in Student Center. Please contact Professor Kizilcec (kizilcec@cornell.edu) for any questions.\n",
        "Need Note": false
    }
}