{
    "INFO1260": {
        "Title": "Choices and Consequences in Computing",
        "Course Code": "INFO1260",
        "Description": "\n            Computing requires difficult choices that can have serious implications for real people. This course covers a range of ethical, societal, and policy implications of computing and information. It draws on recent developments in digital technology and their impact on society, situating these in the context of fundamental principles from computing, policy, ethics, and the social sciences. A particular emphasis will be placed on large areas in which advances in computing have consistently raised societal challenges: privacy of individual data; fairness in algorithmic decision-making; dissemination of online content; and accountability in the design of computing systems. As this is an area in which the pace of technological development raises new challenges on a regular basis, the broader goal of the course is to enable students to develop their own analyses of new situations as they emerge at the interface of computing and societal interests.\n        ",
        "Combined Course": [
            "CS1340"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "ETM-AS",
            "SDS-AS",
            "KCM-AG",
            "OPHLS-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO1300": {
        "Title": "Introductory Design and Programming for the Web",
        "Course Code": "INFO1300",
        "Description": "\n            This course is designed to introduce students to the conceptual, design, and technical aspects of developing websites. No prior knowledge of programming, or web or graphic design is assumed or necessary. In the course, we will cover basic web technologies such as HyperText Markup Language (HTML), Cascading StyleSheets (CSS), and some JavaScript (JS).\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO1998": {
        "Title": "First-year Team Projects",
        "Course Code": "INFO1998",
        "Description": "\n            Independent work in information science as part of a student-led team project. Intended for first-year students on project teams, project team members in training, and for project team members performing tasks that are not core to information science.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Primarily for: first-year students.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO2310": {
        "Title": "Interactive Web Application Design and Development",
        "Course Code": "INFO2310",
        "Description": "\n            This course introduces students to the conceptual, design, and technical aspects of making interactive web applications. Students participate in a) JavaScript programming lectures outlining both client and server-side components of successful web applications which use HTTP communication, b) exercises which illustrate the benefits and tradeoffs of application design patterns such as handling application data client-side or server-side, and c) in- and out-of-class activities implementing user-facing web applications. Throughout the semester, students will create usable and accessible systems by employing the interaction design principles they learn. This course assumes no prior programming experience.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA23"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112"
            ],
            [
                "INFO1300"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: CS 1110 or CS 1112 and INFO 1300. ",
        "Comments": "Must take INFO 2300 or INFO 2310 before INFO 3300.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO2951": {
        "Title": "Introduction to Data Science with R",
        "Course Code": "INFO2951",
        "Description": "\n            This is an applied introductory course for students who wish to harness growing digital and computational resources. The focus of the course is on using data to identify patterns, evaluate the strength and significance of relationships, and generate predictions using data, carrying students through the entire data science workflow from data collection to communication of results. These techniques are implemented using a reproducible workflow, programmatic techniques, and version control software. Students will learn how to use data to make effective arguments, in a way that promotes the ethical usage of data.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "STSCI2100",
                "MATH1710"
            ],
            [
                "CS1110",
                "CS1112"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: One course in core statistics (MATH 1710 or equivalent) and one course in core programming (CS 1110 or CS 1112), or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": true
    },
    "INFO3130": {
        "Title": "Data and the State: How Governments See People and Places",
        "Course Code": "INFO3130",
        "Description": "\n            In order to regulate and govern, states must marshall data: the whos, whats, and wheres of a nation get rendered in records and statistics, at least approximately, and they tell us a lot about identity and values. In this course we will use Census data as a jumping-off point for an investigation of data practices of governance. Students will learn tools for geospatial data science in Python/Geopandas and will learn principles of mapping. Readings include selections from geography, anthropology, science and technology studies, and urban sociology.\n        ",
        "Combined Course": [
            "PUBPOL2130"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": "Recommended prerequisite: computer programming familiarity in any language.",
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO3140": {
        "Title": "Computational Psychology",
        "Course Code": "INFO3140",
        "Description": "\n            This course states and motivates the observation that cognition is fundamentally a computational process and explores the implications of this idea. Students are introduced to a variety of conceptual tools for thinking about cognitive information processing, including statistical learning from experience and the use of patterns distilled from past experience in guiding future actions. They learn to apply these tools to gain understanding of perception, memory, motor control, language, action planning, problem solving, decision making, reasoning, intelligence, and creativity.\n        ",
        "Combined Course": [
            "COGST3140",
            "COGST6140",
            "PSYCH3140",
            "PSYCH6140"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "ETM-AS",
            "KCM-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: one course each in psychology and statistics, or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "INFO3152": {
        "Title": "Introduction to Computer Game Design",
        "Course Code": "INFO3152",
        "Description": "\n            A project-based course in which programmers and designers collaborate to make a computer game. This course investigates the theory and practice of developing computer games from a blend of technical, aesthetic, and cultural perspectives. Technical aspects of game architecture include software engineering, artificial intelligence, game physics, computer graphics, and networking. Aesthetic and cultural aspects include art and modeling, sound and music, game balance, and player experience.\n        ",
        "Combined Course": [
            "CS3152"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SMR-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [
            [
                "ENGRC3152"
            ]
        ],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite for programmers: CS 2110, or permission of instructor. Prerequisite for designers: INFO 2450 and/or submission of art/design samples to instructor. Designers should have some background in either art or interface design. Corequisite: ENGRC 3152.",
        "Comments": "Students may take this course as either a programmer or a designer. Contact the instructor for more information.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://gdiac.cs.cornell.edu/gdiac/applications/ to apply.\n",
        "Need Note": false
    },
    "INFO3200": {
        "Title": "Technology, Behavior and Society",
        "Course Code": "INFO3200",
        "Description": "\n            This course addresses the contemporary socio- technological challenges and debates about digital media and information technologies and their impact on society. It covers a broad spectrum of topics spanning digital technologies, social behaviors, and society. We will critically evaluate research evidence and its relevance to various social contexts and practices, diverse users and uses of social media, ethical and policy implications, trade-offs of potential solutions, and the impact of socio-technological shifts on individuals and communities. Our overarching goal is to challenge commonplace assumptions about these tools and phenomena; and to ask deeper questions about their profound impact on society.\n        ",
        "Combined Course": [
            "COMM3200"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO3312": {
        "Title": "Data Communication",
        "Course Code": "INFO3312",
        "Description": "\n            Data scientists often present information to disseminate their findings. This course introduces theories and applications of communicating with data, with an emphasis on visualizations. To support this approach, we will focus on the what, why, and how of data visualization. \"What\" focuses on specific types of visualizations for a particular purpose, as well as tools for constructing these plots. In \"how\" we will focus on the process of generating a data visualization from pre-processing the raw data, mapping attributes of the data to plot aesthetics, strategically determining how to define the visual encoding of the data for maximal accessibility, and finalizing the visualization to consider the importance of visual appeal. In \"why\" we discuss the theory tying together the \"how\" and the \"what\", and consider empirical evidence of best-practices in data communication.\n        ",
        "Combined Course": [
            "INFO5312"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SDS-AS",
            "OPHLS-AG"
        ],
        "Prerequisites": [
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950. ",
        "Comments": "Prior experience with R and Git is required.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO3950": {
        "Title": "Data Analytics for Information Science",
        "Course Code": "INFO3950",
        "Description": "\n            This course will cover intermediate-level applications of data science, with focus on discovery, interpretation, and communication of meaningful patterns in data. Topics will include regression, classification, clustering, and forecasting, with an overview of machine learning algorithms and statistical inference.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112",
                "CS1133"
            ],
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950 or equivalent, plus substantial comfort with python programming in Jupyter notebook.",
        "Comments": "Note: This course may not be taken for credit after or concurrently with CS 3780 or ECE 4200.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Please fill out this form to add yourself to the waitlist: https://pgcourse.infosci.cornell.edu/cgi-bin/waitlist3950.py For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": true
    },
    "INFO4100": {
        "Title": "Learning Analytics",
        "Course Code": "INFO4100",
        "Description": "\n            Technology has transformed how people teach and learn today. It also offers unprecedented insight into the mechanics of learning by collecting detailed interaction and performance data, such as in online courses and learning management systems like Canvas. At the intersection of education and data science, learning analytics are used to make sense of these data and use them to improve teaching and learning. This course blends learning theories and methodologies covering a wide range of topics with weekly hands-on activities and group projects using real-world educational datasets. You will learn how learning works, major theories in the learning sciences, and data science methods. Students collect and analyze their own learning trace data as part of the course. Learning outcomes: Students will learn to articulate key ideas in the learning sciences; articulate the potential benefits and dangers of learning analytics for students, teachers, and institutions; choose and apply appropriate methods for analyzing different kinds of educational data and be able to articulate why; and interpret the results of basic learning analytics.\n        ",
        "Combined Course": [
            "INFO5101"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SDS-AS",
            "LA-AG"
        ],
        "Prerequisites": [
            [
                "CS1110"
            ],
            [
                "AEM2100"
            ],
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950 or equivalent, AEM 2100, CS 1110.",
        "Comments": "Demonstrated knowledge of R expected.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4120": {
        "Title": "Ubiquitous Computing",
        "Course Code": "INFO4120",
        "Description": "\n            This course will introduce students to the field of Ubiquitous Computing - a multidisciplinary research area that draws from Machine Learning, Machine Perception, Signal Processing, Human Computer Interaction, as well as psychology and sociology. Class discussions and hands on exercises will be the focus of this class with a few formal lectures. Discussions will highlight the various challenges in data collection, representation and tractability of models, and evaluation. We will brainstorm ideas on how future research can go about tackling some of these challenges. Students will be required to lead and critique papers. Everyone will take turns presenting papers and leading discussions. Participation in discussions will be evaluated as well as mini projects assignments during the term and an end of term final project.\n        ",
        "Combined Course": [
            "INFO6120"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1112"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: CS 1112 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment primarily for: juniors, seniors, and first-year graduate students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4152": {
        "Title": "Advanced Topics in Computer Game Design",
        "Course Code": "INFO4152",
        "Description": "\n            Project-based follow-up course to INFO 3152. Students work in a multidisciplinary team to develop a game that incorporates innovative game mechanics. Advanced topics include nontraditional input schemes, advanced storytelling, social gameplay, and \"serious\" games. There is a special emphasis on developing games that can be submitted to festivals and competitions, or that can be commercialized.\n        ",
        "Combined Course": [
            "CS4152",
            "CS5152",
            "INFO5152"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SMR-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [
            [
                "ENGRC4152"
            ]
        ],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite for programmers: INFO 3152, CS 3300/INFO 3300 or CS 4620 or CS 3700 or CS 5414, or permission of the instructor. Prerequisite for designers: INFO 3152 and INFO 3450, or permission of the instructor. Corequisite: ENGRC 4152.",
        "Comments": "Students may take this course as either a programmer or a designer. Contact the instructor for more information.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://gdiac.cs.cornell.edu/gdiac/applications/ to apply.\n",
        "Need Note": false
    },
    "INFO4220": {
        "Title": "Networks II: Market Design",
        "Course Code": "INFO4220",
        "Description": "\n            Networks II builds on its prerequisite course and continues to examine how each of the computing, economic, sociological and natural worlds are connected and how the structure of these connections affects these worlds. In this course, we will construct mathematical models for and analyze networked settings, allowing us to both make predictions about behavior in such systems, as well as reason about how to design such systems to exhibit some desirable behavior. Throughout, we will draw on real-world examples such as social networks, peer-to-peer filesharing, Internet markets, and crowdsourcing, that illustrate these phenomena.\n        ",
        "Combined Course": [
            "CS4852",
            "ECON3825",
            "INFO6220"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO2040"
            ],
            [
                "CS2800"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2040, CS 2800 or equivalent.",
        "Comments": "Knowledge of basic probability and statistics expected. ",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4250": {
        "Title": "Surveillance and Privacy",
        "Course Code": "INFO4250",
        "Description": "\n            This course explores the social, legal, and ethical facets of surveillance in modern life. New information technologies facilitate data collection at unprecedented scales and reaching across multiple domains. We explore the history and theory of data collection for purposes of social and political control, and how privacy is conceptualized and deployed in response to surveillant systems. We discuss how surveillance and privacy are situated in law and culture; the emergence of surveillance in law enforcement, workplaces, institutions, families, and self-tracking contexts; and the relationships among surveillance, power, and marginalization of vulnerable groups. We consider avenues through which surveillance is resisted, including technological and policy-based design strategies to mitigate the effects of data collection.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO1200"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1200 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4260": {
        "Title": "Computing On Earth: Planetary Dimensions and Consequence of Computing",
        "Course Code": "INFO4260",
        "Description": "\n            This experimental, collaborative and seminar-based class will explore the material ethics of computing – the ways in which computing rests upon, emerges from, and ultimately returns to the earth, with deep and sometimes negative implications for sustainability, equity and justice in a rapidly changing world. Drawing on journalistic sources and academic fields ranging from anthropology, philosophy, public policy and environmental ethics to law, science and technology studies and human-computer interaction, the course will examine problems of computing-related sourcing and extraction, energy and consumption, and waste and repair, and how these are distributed and experienced in vastly different ways by different social groups and actors. Cases and examples will be drawn from near-to-hand and around the world.\n        ",
        "Combined Course": [
            "INFO5260",
            "STS4260"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO1200",
                "INFO1260",
                "CS1340"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1200 or INFO 1260 or CS 1340 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4300": {
        "Title": "Language and Information",
        "Course Code": "INFO4300",
        "Description": "\n            How to make sense of the vast amounts of information available online, and how to relate it and to the social context in which it appears? This course introduces basic tools for retrieving and analyzing unstructured textual information from the web and social media. Applications include information retrieval (with human feedback), sentiment analysis, and social analysis of text. The coursework will include programming projects that play on the interaction between knowledge and social factors.\n        ",
        "Combined Course": [
            "CS4300"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SDS-AS",
            "OPHLS-AG"
        ],
        "Prerequisites": [
            [
                "CS2800"
            ],
            [
                "CS2110",
                "CS2112"
            ],
            [
                "MATH2210",
                "MATH2230",
                "MATH2310",
                "MATH2940"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: 1) Linear algebra: strong performance in MATH 2940 or equivalent; 2) Discrete math: strong performance in CS 2800 or equivalent. Note: The linear algebra and discrete math requirements can also be fulfilled with a strong performance in INFO 2950; and 3) Programming proficiency: CS 2110 or equivalent with strong Python skills and familiarity with IPython Notebooks, or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": true
    },
    "INFO4310": {
        "Title": "Interactive Information Visualization",
        "Course Code": "INFO4310",
        "Description": "\n            This course explores a variety of techniques for making appealing and convincing representations of digital data. Students will build a toolbox of techniques for representing information, explore ways for making visualizations interactive, investigate how cognition makes data easy or hard to understand, and use their web development and data-scraping abilities to construct new visualizations. Projects centered around current issues will allow students to make use of their new knowledge both individually and in groups, and in-class critique sessions will refine their understanding of what makes for successful and unsuccessful designs.\n        ",
        "Combined Course": [
            "INFO5311"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO3300",
                "CS3300",
                "INFO5100"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 3300/CS 3300 or INFO 5100 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://docs.google.com/forms/d/e/1FAIpQLScsiE1c1pdVFKSFtWiF0EZADLH7wwF0nys5CaHc0cxrL4E06g/viewform?usp=sf_link to apply.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4320": {
        "Title": "Introduction to Rapid Prototyping and Physical Computing",
        "Course Code": "INFO4320",
        "Description": "\n            This class provides an introduction to modern rapid prototyping techniques such as laser cutting, 3D printing and microcontroller programming (such as the Arduino system). Using these tools, small multidisciplinary groups conduct the hardware project of their choice exploring topics as varied as: Universal Access, tangible interfaces, toys, personal or medical assistants and new musical instruments.\n        ",
        "Combined Course": [
            "INFO5321"
        ],
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO2300"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2300. ",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          To enroll in this course, please fill out the application here: https://forms.gle/ENYBmTeL37XwdnrD6.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4340": {
        "Title": "App Design and Prototyping",
        "Course Code": "INFO4340",
        "Description": "\n            In this interactive studio-based course, students will work in teams to complete a significant project. Students will gain practical experience and confidence applying the user-centered design process to design, code, and evaluate a high-fidelity prototype app. Through the project, students will learn how design effective graphical user interfaces using affordances, user feedback, and common interface controls.\n        ",
        "Combined Course": [
            "INFO5440"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO2300",
                "INFO2310"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2300 or INFO 2310 or equivalent programming experience.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4360": {
        "Title": "Communication Networks and Social Capital",
        "Course Code": "INFO4360",
        "Description": "\n            Course covers the relationship between communication networks and social capital and explores the tension between individual and group capital.\n        ",
        "Combined Course": [
            "COMM4360"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2450",
                "INFO2450",
                "INFO2040"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2450/INFO 2450 or INFO 2040.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4400": {
        "Title": "Qualitative User Research and Design Methods",
        "Course Code": "INFO4400",
        "Description": "\n            This upper-level course provides an in-depth understanding of and experience with advanced concepts and techniques for researching, ideating, critiquing, designing, prototyping, and evaluating interactive technologies intended for people to use and incorporate in their lives. The course focuses on advanced user research and design methods.\n        ",
        "Combined Course": [
            "COMM4400",
            "INFO5400",
            "INFO6400"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM3450",
                "INFO3450",
                "INFO5355"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 3450/INFO 3450/INFO 5355 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4410": {
        "Title": "Re-Designing Robots",
        "Course Code": "INFO4410",
        "Description": "\n            This course provides an introduction to human robot interaction. Students will be working alone and in teams to design and examine novel ways for robots to interact with people. In parallel to the design projects students will be introduced to current research on human-robot interaction. Topics include: video interaction analysis, prototyping, and evaluation. This course will require students to re-design a physical robot using basic mechatronics skills with Arduino or similar platforms. Focus of the class will be on designing the interaction with the robot through experimentation with a physical system.\n        ",
        "Combined Course": [
            "CS4754",
            "INFO6420"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [
            [
                "INFO4320"
            ]
        ],
        "Specific Requirements": "Prerequisite or corequisite: INFO 4320, or an equivalent mechatronics course, or permission of instructor.",
        "Comments": "Ph.D. students should enroll in INFO 6420.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          To enroll in this course, please complete the following application: https://forms.gle/UiKY5MWrioLxZ21o9.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": true
    },
    "INFO4450": {
        "Title": "Computer-Mediated Communication",
        "Course Code": "INFO4450",
        "Description": "\n            Focuses on reading and evaluating the theories and research methodologies used to investigate communication via computer systems. Assignments include student collaborations using electronic conferencing and other advanced communication technologies, as well as reflections on and evaluations of these collaborations in light of current theories and research findings. Topics include virtual teams, videoconferencing, and others as they emerge.\n        ",
        "Combined Course": [
            "COMM4450",
            "COMM6450",
            "INFO5450",
            "INFO6450"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4900": {
        "Title": "Independent Reading and Research",
        "Course Code": "INFO4900",
        "Description": "\n            Independent reading and research for undergraduates.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: Independent Studies\n",
        "Need Note": false
    },
    "INFO4910": {
        "Title": "Teaching in Information Science",
        "Course Code": "INFO4910",
        "Description": "\n            Involves working as a teaching assistant in a course in the information science or information science, systems, and technology major.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: Independent Studies\n",
        "Need Note": false
    },
    "INFO4940": {
        "Title": "Special Topics in Information Science",
        "Course Code": "INFO4940",
        "Description": "\n            This course explores what artificial intelligence (AI) can teach us about human storytelling. We'll tackle this question through a two-pronged approach: story understanding and story generation. Students will explore how AI and machine learning technologies have revolutionized our approach to analyzing narratives as well as computational methods and concepts for modeling stories, moving towards a broader understanding of storytelling's societal effects.\n        ",
        "Combined Course": [
            "INFO5940"
        ],
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4997": {
        "Title": "Practical Training in Information Science",
        "Course Code": "INFO4997",
        "Description": "\n            This independent study course offers IS majors (i.e., undergraduates whose applications to affiliate with the IS major have been approved) an opportunity to reflect on concepts from information science as they were encountered and applied in a recent internship. Students write a short paper describing their work experience and how it connects to the educational objectives of the information science major.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            0.25
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Primarily for: undergraduate INFO majors whose application to affiliate has been approved and who require work authorization for an employer other than Cornell.",
        "Foot Note": "\nInstruction Mode: Independent Studies\n",
        "Need Note": false
    },
    "INFO4998": {
        "Title": "Team Projects",
        "Course Code": "INFO4998",
        "Description": "\n            Advanced independent work in information science as part of a student-led team project. Students must make individual arrangements with a faculty sponsor. Students are expected to spend 3-4 hours per week per credit hour working on the project.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: sophomores, juniors, or seniors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5000": {
        "Title": "Practical Training in Information Science for International Students",
        "Course Code": "INFO5000",
        "Description": "\n            This independent study course offers IS MPS Grad Students strictly for CPT purposes only.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: International INFO MPS students requiring CPT.",
        "Foot Note": "\nInstruction Mode: Independent Studies\n",
        "Need Note": false
    },
    "INFO5101": {
        "Title": "Learning Analytics",
        "Course Code": "INFO5101",
        "Description": "\n            Technology has transformed how people teach and learn today. It also offers unprecedented insight into the mechanics of learning by collecting detailed interaction and performance data, such as in online courses and learning management systems like Canvas. At the intersection of education and data science, learning analytics are used to make sense of these data and use them to improve teaching and learning. This course blends learning theories and methodologies covering a wide range of topics with weekly hands-on activities and group projects using real-world educational datasets. You will learn how learning works, major theories in the learning sciences, and data science methods. Students collect and analyze their own learning trace data as part of the course. Learning outcomes: Students will learn to articulate key ideas in the learning sciences; articulate the potential benefits and dangers of learning analytics for students, teachers, and institutions; choose and apply appropriate methods for analyzing different kinds of educational data and be able to articulate why; and interpret the results of basic learning analytics.\n        ",
        "Combined Course": [
            "INFO4100"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Demonstrated knowledge of R expected.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5152": {
        "Title": "Advanced Topics in Computer Game Design",
        "Course Code": "INFO5152",
        "Description": "\n            Students work in a multidisciplinary team to develop a game that incorporates innovative game mechanics. Advanced topics include nontraditional input schemes, advanced storytelling, social gameplay, and \"serious\" games.  There is a special emphasis on developing games that can be submitted to festivals and competitions, or that can be commercialized. Students may take this course as either a programmer or a designer; the prerequisites differ depending upon the selected track. Contact the instructor for more information.\n        ",
        "Combined Course": [
            "CS4152",
            "CS5152",
            "INFO4152"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [
            [
                "ENGRC5152"
            ]
        ],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite for programmers: INFO 3152, CS 3300/INFO 3300 or CS 4620 or CS 3700 or CS 5414 or permission of the instructor. Prerequisite for designers: INFO 3152 and INFO 3450, or permission of the instructor. Corequisite: ENGRC 5152 .",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://gdiac.cs.cornell.edu/gdiac/applications/ to apply.\n",
        "Need Note": false
    },
    "INFO5213": {
        "Title": "Discrete Optimization for Urban Planning and Mobility",
        "Course Code": "INFO5213",
        "Description": "\n        No description available.\n        ",
        "Combined Course": [
            "ORIE5213"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5260": {
        "Title": "Computing On Earth: Planetary Dimensions and Consequence of Computing",
        "Course Code": "INFO5260",
        "Description": "\n            This experimental, collaborative and seminar-based class will explore the material ethics of computing – the ways in which computing rests upon, emerges from, and ultimately returns to the earth, with deep and sometimes negative implications for sustainability, equity and justice in a rapidly changing world. Drawing on journalistic sources and academic fields ranging from anthropology, philosophy, public policy and environmental ethics to law, science and technology studies and human-computer interaction, the course will examine problems of computing-related sourcing and extraction, energy and consumption, and waste and repair, and how these are distributed and experienced in vastly different ways by different social groups and actors. Cases and examples will be drawn from near-to-hand and around the world.\n        ",
        "Combined Course": [
            "INFO4260",
            "STS4260"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO1200",
                "INFO1260",
                "CS1340"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1200 or INFO 1260 or CS 1340 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5304": {
        "Title": "Data Science in the Wild",
        "Course Code": "INFO5304",
        "Description": "\n            Massive amounts of data are collected by many companies and organizations and the task of a data scientist is to extract actionable knowledge from the data – for scientific needs, to improve public health, to promote businesses, for social studies and for various other purposes. This course will focus on the practical aspects of the field and will attempt to provide a comprehensive set of tools for extracting knowledge from data.\n        ",
        "Combined Course": [
            "CS5304"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5305": {
        "Title": "User Experience and User Research",
        "Course Code": "INFO5305",
        "Description": "\n            This course takes a deep dive into the user experience (UX) lifecycle--from conceiving an idea for a product to evaluating a prototype--and user research methods. We will cover techniques for understanding your target users (e.g., observations and interviews) and designing and evaluating your prototypes (e.g., lab studies and walkthroughs). If you have taken a human computer interaction class before, many of these techniques will be familiar. Our goal in this course is to go deeper, help you gain more practice and expertise so that you will be ready to apply what you learn when you graduate. The course lectures will cover the theory, history, and practical aspects of UX and user research methods. Student deliverables include many short in-class exercises and weekly homework assignments.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5311": {
        "Title": "Interactive Information Visualization",
        "Course Code": "INFO5311",
        "Description": "\n            This course explores a variety of techniques for making appealing and convincing representations of digital data. Students will build a toolbox of techniques for representing information, explore ways for making visualizations interactive, investigate how cognition makes data easy or hard to understand, and use their web development and data-scraping abilities to construct new visualizations. Projects centered around current issues will allow students to make use of their new knowledge both individually and in groups, and in-class critique sessions will refine their understanding of what makes for successful and unsuccessful designs.\n        ",
        "Combined Course": [
            "INFO4310"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO5100"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 5100 or permission of instructor. ",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://docs.google.com/forms/d/e/1FAIpQLScsiE1c1pdVFKSFtWiF0EZADLH7wwF0nys5CaHc0cxrL4E06g/viewform?usp=sf_link to apply.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5312": {
        "Title": "Data Communication",
        "Course Code": "INFO5312",
        "Description": "\n            Data scientists often present information to disseminate their findings. This course introduces theories and applications of communicating with data, with an emphasis on visualizations. To support this approach, we will focus on the what, why, and how of data visualization. \"What\" focuses on specific types of visualizations for a particular purpose, as well as tools for constructing these plots. In \"how\" we will focus on the process of generating a data visualization from pre-processing the raw data, mapping attributes of the data to plot aesthetics, strategically determining how to define the visual encoding of the data for maximal accessibility, and finalizing the visualization to consider the importance of visual appeal. In \"why\" we discuss the theory tying together the \"how\" and the \"what\", and consider empirical evidence of best-practices in data communication.\n        ",
        "Combined Course": [
            "INFO3312"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO5001"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 5001. ",
        "Comments": "Prior experience with R and Git is required.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5320": {
        "Title": "Trust and Safety: Platforms, Policies, Products",
        "Course Code": "INFO5320",
        "Description": "\n            Trust & Safety is an emerging field that focuses on reducing the harm from interpersonal abuse in digital spaces. The abuse types involved - harassment, misinformation, unwanted sexual content - are often \"lawful but awful,\" requiring developers to build their own socio-technical frameworks of what is appropriate behavior in their platform. In this course, we will look at digital abuse through an analysis of historical incidents. We will study how the field developed standards across algorithmic response, product design and manual removals. Students will join teams to describe an emerging online abuse type, develop appropriate moderation pipelines (e.g., using modern machine learning such as LLMs), and detail associated policies, all in an environment mimicking the realities seen in practice. This course might expose students to disturbing material.\n        ",
        "Combined Course": [
            "CS5342"
        ],
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5321": {
        "Title": "Introduction to Rapid Prototyping and Physical Computing",
        "Course Code": "INFO5321",
        "Description": "\n            This class provides an introduction to modern rapid prototyping techniques such as laser cutting, 3D printing and microcontroller programming (such as the Arduino system). Using these tools, small multidisciplinary groups conduct the hardware project of their choice exploring topics as varied as: Universal Access, tangible interfaces, toys, personal or medical assistants and new musical instruments.\n        ",
        "Combined Course": [
            "INFO4320"
        ],
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          To enroll in this course, please fill out the application here: https://forms.gle/ENYBmTeL37XwdnrD6.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5330": {
        "Title": "Technology, Media, and Democracy",
        "Course Code": "INFO5330",
        "Description": "\n            This course evaluates the role of the information ecosystem in contributing to the health of our society with the goal of developing ideas and tools that can help citizens be equipped with the knowledge and information required to address the challenges that we face. Specifically, the course examines the socio-technical aspects of our information ecosystem and how they may hinder, or challenge, the functions of society in particular in representative democracies such as the United States. Key topics include (a) how the design of platforms, algorithms, monetary models, and online communities impacts our information ecosystem; (b) the challenges for credible and trustworthy information ecosystem and how can they be addressed; (c) the breadth of abuse and adversary online from mis- and disinformation to online harassment, including the types of abuse, the adversarial actors online, what are they goals, methods, and how they can be countered.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5342": {
        "Title": "Designing Ubiquitous and Interactive Computing Devices",
        "Course Code": "INFO5342",
        "Description": "\n            This course will introduce students to the fields of ubiquitous computing and interactive device design, drawing from such diverse fields as electronic circuit design, signal processing, machine learning, and human-computer interaction. Taking a hands-on, lab-based approach, students will prototype their own interactive devices and use them to collect data and interact with users. Students will learn about fabrication techniques and printed circuit board design, and apply them to create their own devices. For the final project, students will build a functional embedded or wearable device that can be applied to problems in health technology, urban design or other real-world applications. Topic areas include electronics, sensors, actuators, interface design, physical prototyping, and user testing.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5358": {
        "Title": "3D Interaction Design",
        "Course Code": "INFO5358",
        "Description": "\n            Designing products and experiences for head-mounted displays, often with novel inputs such as hands and eyes, introduces new challenges for designers when compared to traditional devices and user interfaces. This course presents the theoretical and practical foundations of the field of 3D User Interfaces (3DUIs) and 3D interaction design for virtual and augmented reality applications. The course will highlight the differences between 2D and 3D interaction design, introduce design principles, best practices for prototyping, and case studies. Students will be tasked with designing, implementing, and evaluating interaction prototypes of different fidelity for 3DUI tasks such as selection and manipulation, travel, and system control.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5368": {
        "Title": "Practical Applications in Machine Learning (PAML)",
        "Course Code": "INFO5368",
        "Description": "\n            This course provides hands-on experience developing and deploying foundational machine learning algorithms on real-world datasets for practical applications (e.g., healthcare, computer vision). Students will learn about the machine learning pipeline end-to-end including dataset creation, pre- and post-processing, annotation, annotation validation, preparation for machine learning, training and testing a model, and evaluation. Students will focus on real-world challenges at each stage of the ML pipeline while handling bias in models and datasets. Lastly, students will analyze the strengths and weaknesses of regression, classification, clustering, and deep learning algorithms.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112",
                "CS1133"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: recommended coursework in Python Programming",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": true
    },
    "INFO5375": {
        "Title": "Machine Learning for Health",
        "Course Code": "INFO5375",
        "Description": "\n            This course introduces students the various real-world health related problems such as patient screening, risk modeling, disease subtyping and precision medicine, along with their associated data, such as patient clinical records, medical images, physiological and vital signals from wearable sensors, multi-omics, etc. and how to use appropriate machine learning algorithms to analyze these data and help with the corresponding real-world health problems. The machine learning techniques involved in this class include classic supervised and unsupervised learning, network analysis, probabilistic modeling, deep learning, transfer learning, federated learning, algorithmic fairness and interpretability. We will also invite clinicians or researchers working in the health industry to deliver guest lecturers in the class. The students will gain hands-on experience on analyzing real world health data during course assignments and projects.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112",
                "CS1133"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: basic knowledge of machine learning, algorithms and python programming.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech Students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": true
    },
    "INFO5400": {
        "Title": "Qualitative User Research and Design Methods",
        "Course Code": "INFO5400",
        "Description": "\n            This upper-level course provides an in-depth understanding of and experience with advanced concepts and techniques for researching, ideating, critiquing, designing, prototyping, and evaluating interactive technologies intended for people to use and incorporate in their lives. The course focuses on advanced user research and design methods.\n        ",
        "Combined Course": [
            "COMM4400",
            "INFO4400",
            "INFO6400"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO3450",
                "COMM3450",
                "INFO5355"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 3450/COMM 3450 /INFO 5355 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5420": {
        "Title": "Urban Design Strategies and Case Studies",
        "Course Code": "INFO5420",
        "Description": "\n            The course will ground students in the basics of urban and spatial design practices as well as the surrounding environmental, sociological, political, and economic dimensions. This course will use primary and secondary source material and theoretical and empirical works to understand cities as complex interrelated environments.  Students will learn about the multidimensional drivers that shape the urban systems and built environment that form our cities.  The course will teach students how to analyze and transform urban environments to create livable and sustainable cities for future generations. The course will also contribute a design perspective for the program: project based, empirical, iterative, situated, and integrative. The course uses New York City as a real-world laboratory and augments foundational and theoretical examples with case studies of successful and unsuccessful initiatives. Students will develop projects that address urgent urban challenges such as sustainability, infrastructure, resiliency, mobility, affordability, access, and equity and will propose forward-thinking and technologically driven design approaches to urban challenges.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO5410"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 5410.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech Urban Tech students.\n",
        "Need Note": false
    },
    "INFO5440": {
        "Title": "App Design and Prototyping",
        "Course Code": "INFO5440",
        "Description": "\n            In this interactive studio-based course, students will work in teams to complete a significant project. Students will gain practical experience and confidence applying the user-centered design process to design, code, and evaluate a high-fidelity prototype app. Through the project, students will learn how design effective graphical user interfaces using affordances, user feedback, and common interface controls.\n        ",
        "Combined Course": [
            "INFO4340"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Prior experience with client and server-side web programming reguired.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5450": {
        "Title": "Computer-Mediated Communication",
        "Course Code": "INFO5450",
        "Description": "\n            For description and learning outcomes, see INFO 4450. \n        ",
        "Combined Course": [
            "COMM4450",
            "COMM6450",
            "INFO4450",
            "INFO6450"
        ],
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: MPS students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5455": {
        "Title": "Smart Cities: Requirements, Ambitions, and Limitations",
        "Course Code": "INFO5455",
        "Description": "\n            The smart cities movement was born during the Global Financial Crisis of 2007-8. When multinationals slashed spending on IT, governments ramped up stimulus spending. Big vendors like IBM, Cisco, and Siemens seized the opportunity to port enterprise tech to the municipal sector. This project didn't get far. While there have been successes, city governments were slow to define and procure smart cities solutions. And the context changed. Consumer tech innovation raced ahead, drawing a new group of giant firms into the fray. They brought new technologies, but also more money, new business models, and more aggressive approaches to government affairs and deregulation. This shift from smart cities to urban tech is ongoing and defines the landscape for engineering cyberphysical urban systems today. This course is a survey of smart cities and urban tech for engineers, organized around 12-15 broad technical capabilities that reflect widely-shared views of what this movement seeks to achieve.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech Students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5900": {
        "Title": "MPS Project",
        "Course Code": "INFO5900",
        "Description": "\n            Independent research for Master of Professional Studies students.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: Directed Research\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5905": {
        "Title": "Professional Career Development",
        "Course Code": "INFO5905",
        "Description": "\n            This course will focus on career development topics specifically for MPS Information Science students. Through a series of discussions, activities, and guest speaker lectures, students will further develop career success strategies with an emphasis on personal strengths, networking, communication, and professional branding. By the end of the course, students will be able to identify and articulate to prospective employers, their unique interface between computing and the world.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            0.5
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "This course is a required part of the MPS curriculum. Students who have completed ENGRG 5350 or have received a job offer may petition to waive this course by emailing bae2@cornell.edu.  ",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: MPS and early admission undergraduate students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5915": {
        "Title": "Remaking the City",
        "Course Code": "INFO5915",
        "Description": "\n            This workshop-based service learning course will engage students in participatory design projects that use technology to support community-based organizations in urban contexts. The engagement will be structured as team-based internships, where students will be required to commit up to 5 hours per week to support the organization in its technology needs. We will reflect on these experiences, and connect them to broader themes impacting cities and the civic organizations within them – including migration, race, gender and disability. Students will learn and apply user-centered and participatory design methodologies; theoretical frameworks that help us understand the modern city; the unique technology challenges facing small community-based and civic organizations.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5920": {
        "Title": "Specialization Project for Connective Media, Health Tech, and Urban Tech",
        "Course Code": "INFO5920",
        "Description": "\n            All students of the Jacobs Institute are required to complete a two-semester Specialization research project. We offer two Tracks for completing this requirement. * Track 1 Specialization projects are conducted in small teams on topics suggested and supervised by researchers at Cornell Tech or Weill Cornell. Track 1 students register for 4 credits of INFO 5920 in their first year Spring semester, as well as 4 credits of INFO 5920 in their second year Fall semester. * Track 2 Specialization project topics can be defined by the student; so long as they are 'anchored' with a 3-credit approved-elective course, and reviewed for program relevance by the INFO 5920 instructor. Track 2 students register for 3 credits of their anchor elective course and 1 credit of INFO 5920 during their first year Spring semester. Track 2 students register for 4 credits INFO 5920 in their second year Fall semester. In general, Specialization projects result in tangible, concentration-relevant deliverables in the form of prototypes, analyses, research studies, and/or publications, which become a sharable part of the student portfolio.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0,
            5.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "TECHIE5901"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: TECHIE 5901.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech Jacobs MS program students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech 1st Year Jacob's students.\n",
        "Need Note": false
    },
    "INFO5940": {
        "Title": "Special Topics in Information Science",
        "Course Code": "INFO5940",
        "Description": "\n            Study of topics not currently covered in INFO offerings, as determined by faculty and student interest.\n        ",
        "Combined Course": [
            "INFO4940"
        ],
        "Semester Offered": [
            "SP25",
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO1200": {
        "Title": "Information Ethics, Law, and Policy",
        "Course Code": "INFO1200",
        "Description": "\n            This course investigates the ethical, legal, and policy foundations of contemporary information technology. Through lectures, readings, discussions, and short assignments, we will address contemporary challenges ranging from the contests over intellectual property and privacy in a networked world to questions of inequality and control over technology. We will cover key areas of technology law and policy such as computing ethics; intellectual property; competition, antitrust, and freedom of expression; privacy and security; and AI ethics. We will also address new ethical questions and controversies that law and policy has yet to sort out. Through this course you'll learn about the key frameworks, processes, and institutions that govern the contemporary world of information technology, along with key theories and methods from academic fields that shape and inform them (law, philosophy, economics, political science, communication, sociology, etc.). You will also learn core reading and analytic skills central to success in the worlds of social science, law, policy, and many other settings. But above all you'll learn to engage critically and strategically with the worlds of information and technology around you, deciding what kind of information consumer, user, producer, and citizen you want to be.\n        ",
        "Combined Course": [
            "STS1201"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO2040": {
        "Title": "Networks",
        "Course Code": "INFO2040",
        "Description": "\n            This interdisciplinary course examines network structures and how they matter in everyday life. The course examines how each of the computing, economic, sociological and natural worlds are connected and how the structure of these connections affects each of these worlds. Tools of graph theory and game theory are taught and then used to analyze networks. Topics covered include the web, the small world phenomenon, markets, neural networks, contagion, search and the evolution of networks.\n        ",
        "Combined Course": [
            "CS2850",
            "ECON2040",
            "SOC2090"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SSC-AS",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO2300": {
        "Title": "Intermediate Design and Programming for the Web",
        "Course Code": "INFO2300",
        "Description": "\n            This course is designed to introduce students to the conceptual, design, and technical aspects of developing server-side interactive websites. Students will learn how to process HTTP requests, dynamically render HTML, populate and store web content in a relational database using SQL, and securely implement login/logout sessions through server-side scripting. Through a succession of projects, students learn and practice how to apply these principles to the creation of interactive and data-driven websites programmed in PHP and SQL. Design, inclusivity, and usability issues are emphasized.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112"
            ],
            [
                "INFO1300"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1300 and CS 1110 or CS 1112.",
        "Comments": "Must be taken before INFO 3300. You will need a static website you designed and coded 100% yourself for the first assignment in this course. Projects from INFO 1300 are suitable. It is strongly recommended that students complete introductory programming before enrolling in this course.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO2450": {
        "Title": "Communication and Technology",
        "Course Code": "INFO2450",
        "Description": "\n            Introduces students to the Communication and Information Technologies focus area of the communication department and the Human Systems track for information science. It examines several approaches to understanding technology and its role in human behavior and society. Topics include psychological aspects of computer-mediated communication; how design plays a role in the way we interface with technology and collaborate with each other; and the ways in which communication technology is situated inside social and institutional structures and cultural formations.\n        ",
        "Combined Course": [
            "COMM2450"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "ETM-AS",
            "KCM-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO2950": {
        "Title": "Introduction to Data Science",
        "Course Code": "INFO2950",
        "Description": "\n            INFO 2950 is an applied introductory course on the foundations of data science, focusing on using data to identify patterns, evaluating the strength and significance of relationships, and generating predictions using data. Topics covered include the core principles of statistical programming (such as data frames, Python/R packages, reproducible workflows, and version control), univariate and multivariate statistical analysis of small and medium-size datasets, regression methods, hypothesis testing, probability models, basic supervised and unsupervised machine learning, data visualization, and network analysis. Students will learn how to use data to make effective arguments in a way that promotes the ethical usage of data. Students who complete the course will be able to produce meaningful, data-driven analyses of real-world problems and will be prepared to begin more advanced work in data-intensive domains.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SDS-AS",
            "OPHLS-AG"
        ],
        "Prerequisites": [
            [
                "STSCI2100",
                "MATH1710"
            ],
            [
                "CS1110",
                "CS1112"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: one course is core statistics (MATH 1710 or equivalent) and one course in core programming (CS 1110 or CS 1112) or permission of instructor.",
        "Comments": "Information Science majors must complete this class prior to their senior year.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": true
    },
    "INFO3300": {
        "Title": "Visual Data Analytics for the Web",
        "Course Code": "INFO3300",
        "Description": "\n            This course will cover technologies for representing, modeling and displaying data in the context of interactive web pages. Practical skills for building web pages will be mixed with data mining algorithms and visualization design theory. We will use the D3 Javascript library to develop both static and dynamic visualizations, learn more about programming in Javascript, and explore web scalable vector graphics (SVG). Through design critique and formal study, we will identify the techniques visualization developers employ to create the \"right\" visualization for a given use case.\n        ",
        "Combined Course": [
            "CS3300",
            "INFO5100"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SDS-AS",
            "OPHLS-AG"
        ],
        "Prerequisites": [
            [
                "INFO2300",
                "INFO2310"
            ],
            [
                "CS2110",
                "ENGRD2110"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: CS 2110/ENGRD 2110 and INFO 2300 or INFO 2310 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://forms.gle/ZU1RJdQkrqYW4BBdA to apply. Upon approval, students are responsible for enrolling themselves with a permission number.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO3350": {
        "Title": "Text Mining History and Literature",
        "Course Code": "INFO3350",
        "Description": "\n            The class will introduce methods for computer-assisted analysis of historical and literary text collections. It will cover corpus curation, representing text as data, building statistical models from text, and interpreting quantitative results. The class will also reflect on how computational methods fit with existing practices in the humanities, and how we can use models as complements to our own interpretations. Following the course, students will be able to assist faculty in quantitative and computational humanities scholarship.\n        ",
        "Combined Course": [
            "INFO6350"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SDS-AS",
            "OPHLS-AG"
        ],
        "Prerequisites": [
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950. ",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Primarily for: students with programming and data science experience, or permission of instructor required.",
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO3450": {
        "Title": "Human-Computer Interaction Design",
        "Course Code": "INFO3450",
        "Description": "\n            This course focuses on user experience design (UX) and the life cycle of interface design from the user perspective. We will discuss key aspects of the human-centered design process: understanding, analyzing, and formalizing user needs, exploring possible design solutions to address user needs, creating prototypes to externalize design ideas, and evaluating the usability of these prototypes.\n        ",
        "Combined Course": [
            "COMM3450",
            "INFO5355"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO3660": {
        "Title": "History and Theory of Digital Art",
        "Course Code": "INFO3660",
        "Description": "\n            In this course, we will examine the role of electronic and digital technologies in the arts of the late 20th and 21st centuries with emphasis on Europe and North America. Beginning with the cybernetically and systems-inspired work of the late sixties, we will explore early uses of computer technology, including early experiments in synthetic video in the 1970s. An overview of pre-internet telematic experiments will lead to an investigation of net art and later currents of digital art. The ongoing development of behavioral art forms will be a central theme. Critical evaluation of various attitudes concerning technology will be encouraged.\n        ",
        "Combined Course": [
            "ARTH3650",
            "ARTH6653",
            "STS3650",
            "VISST3650"
        ],
        "Semester Offered": [
            "FA24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "ALC-AS",
            "CA-AG",
            "LA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO3900": {
        "Title": "Causal Inference",
        "Course Code": "INFO3900",
        "Description": "\n            Causal claims are essential in both science and policy. Would a new experimental drug improve disease survival? Would a new advertisement cause higher sales? Would a person's income be higher if they finished college? These questions involve counterfactuals: outcomes that would be realized if a treatment were assigned differently. This course will define counterfactuals mathematically, formalize conceptual assumptions that link empirical evidence to causal conclusions, and engage with statistical methods for estimation. Students will enter the course with knowledge of statistical inference: how to assess if a variable is associated with an outcome. Students will emerge from the course with knowledge of causal inference: how to assess whether an intervention to change that input would lead to a change in the outcome.\n        ",
        "Combined Course": [
            "ILRST3900",
            "STSCI3900"
        ],
        "Semester Offered": [
            "FA24",
            "FA23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "STSCI2110",
                "PSYCH2500",
                "SOC3010",
                "ECON3110"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: STSCI 2110 or PSYCH 2500 or SOC 3010 or ECON 3110 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4125": {
        "Title": "Project Management",
        "Course Code": "INFO4125",
        "Description": "\n            This introductory course will emphasize the interpersonal skills necessary by project teams to manage demanding industry projects. Through a semester long simulated IS project, students will develop and apply a range of skills including time management, effective conflict resolution, negotiation, risk management, change control, and appropriate goal setting to adequately manage and execute their projects. Students will work in teams to engage in the 5 phases of the project management life cycle which includes: project initiation, planning, execution, monitoring, and project closure.\n        ",
        "Combined Course": [
            "INFO5125"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4145": {
        "Title": "Privacy and Security in the Data Economy",
        "Course Code": "INFO4145",
        "Description": "\n            Increasingly, social and economic interactions are mediated by online platforms and algorithmic systems that rely on ubiquitous connectivity and data accumulation for their operation. While these systems have brought an unprecedented number of new products and services that have fostered growth and innovation, they have also created novel challenges to privacy and data security. In this course, we explore privacy and data security as multi-faceted concepts with economic, legal, social, ethical, and psychological underpinnings.\n        ",
        "Combined Course": [
            "INFO5145"
        ],
        "Semester Offered": [
            "FA24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SSC-AS",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4240": {
        "Title": "Designing Technology for Social Impact",
        "Course Code": "INFO4240",
        "Description": "\n            The social impact of technologies is typically thought about fairly late, if ever, in the design process. Indeed, it can be difficult at design time to predict what effects technologies will have. Nevertheless, design decisions can inadvertently \"lock in\" particular values early on. In this course, we will draw on science & technology studies, technology design, and the arts to analyze the values embodied in technology design and to design technologies to promote positive social impact. What social and cultural values do technology designs consciously or unconsciously promote? To what degree can social impact be \"built into\" a technology? How can we take social and cultural values into account in design?\n        ",
        "Combined Course": [
            "INFO5240",
            "STS4240"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SSC-AS",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Technical background is not needed for this course.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Most seats in this course are restricted to Information Science (INFO) majors. All others will be able to add themselves to a waitlist during add/drop.\n",
        "Need Note": false
    },
    "INFO4301": {
        "Title": "Ethics in New Media, Technology, and Communication",
        "Course Code": "INFO4301",
        "Description": "\n            This course examines moral and ethical issues in communication, new media, and technology. Using theories and research in moral philosophy and psychology, we examine how people perceive and reason about ethical issues presented by media and technology, and how moral action is influenced by cognitive, emotional, and ethical belief systems. Issues of autonomy, transparency, harm, privacy, manipulation, justice, democracy, equality, and care are discussed. We analyze the consistency between personal and professional ethics, the importance of moral character and agency, and the translation of moral thought to ethical action, and address the development of professional and personal ethical codes of conduct and research for communication professionals in the areas of new media and technology.\n        ",
        "Combined Course": [
            "COMM4300",
            "COMM5300",
            "INFO5301"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "CA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: graduate students and seniors, others by permission of department as space allows.\n",
        "Need Note": false
    },
    "INFO4420": {
        "Title": "Human Computer Interaction Studio",
        "Course Code": "INFO4420",
        "Description": "\n            This course will introduce User Experience design technique taught in a Studio. Students will work on a series of design studies and a semester long design project exploring advanced User Interaction design techniques. The course is designed to help students start a design portfolio to reflect their work. Students will be expected to buy small art supplies.\n        ",
        "Combined Course": [
            "INFO6520"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO3450"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 3450 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://forms.gle/KNg9dgja9irDTv9Z7 to apply. Upon approval, students are responsible for enrolling themselves with a permission number.\n",
        "Need Note": false
    },
    "INFO4430": {
        "Title": "Teams and Technology",
        "Course Code": "INFO4430",
        "Description": "\n            This course is designed to provide students with an understanding of research, design, and management of teams whose work and interactions are influenced by technology. Key questions that are addressed include: How does technology influence teamwork? How do we design technology to support teamwork? How do we build effective teams and team interactions for teams that work face to face or online? To address these questions the course will draw primarily from literature in organizational behavior, social psychology, design and human computer interaction. Group exercises will be used to actively build teamwork and team-leadership skills. Topics will include group effectiveness, human robot teamwork, group composition, computer supported collaboration, conflict, group dynamics, temporal issues in groups, geographically distributed teams, and measurement issues of group dynamics and performance.\n        ",
        "Combined Course": [
            "INFO5431"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4500": {
        "Title": "Language and Technology",
        "Course Code": "INFO4500",
        "Description": "\n            Examines how new communication technologies affect the way we produce and understand language and modify interaction with one another. Focuses on the collaborative nature of language use and how Internet technologies affect the joint activities of speakers and listeners during the construction of meaning in conversation\n        ",
        "Combined Course": [
            "COMM4500",
            "COMM6500",
            "INFO6500"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SSC-AS",
            "SBA-AG"
        ],
        "Prerequisites": [
            [
                "COMM2450",
                "INFO2450"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2450/INFO 2450 or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4505": {
        "Title": "Computing and Global Development",
        "Course Code": "INFO4505",
        "Description": "\n            To date, most computing technologies have primarily benefited urban, affluent, and literate people in developed regions by empowering them with more information, resources, and agency. These technologies currently exclude billions of people worldwide, such as rural residents, people with disabilities, and indigenous communities, who are too poor to afford modern devices, too remote to be connected, or too low-literate to navigate the mostly text-driven Internet. In recent years, researchers and practitioners have examined how computing technologies can be designed or appropriated to empower such underserved communities. This course introduces students to the field of Information and Communication Technologies and Development (ICTD). Through discussions of case studies from the Global South, students will study how computing technologies are used in different global development domains, such as agriculture, finance, health, social justice, and education. They will gain understanding of socio-economic, cultural, and political forces that impact technology adoption in low-resource environments and will learn to design, build, and evaluate inclusive technologies to empower marginalized people.​\n        ",
        "Combined Course": [
            "INFO5505"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SSC-AS",
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO4555": {
        "Title": "Business Intelligence Systems",
        "Course Code": "INFO4555",
        "Description": "\n            This course covers the fundamental technical and organizational concepts and challenges related to the development of Business Intelligence Systems, a key component crucial to the competitiveness of a wide range of organizations. Topics covered include: data profiling, dimensional data modeling, data transformation, metadata systems, data governance, data delivery options, and an overview of emerging technologies in this space. Course is comprised of interactive lectures, work/lab sessions, and a substantial team project.\n        ",
        "Combined Course": [
            "INFO5556"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Information Science seniors and juniors. All others must add themselves to the waitlist during add/drop.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5001": {
        "Title": "Computing for Information Science",
        "Course Code": "INFO5001",
        "Description": "\n            This is an applied course for data scientists with little-to-no programming experience who wish to harness growing digital and computational resources. The focus of the course is on generating reproducible research using programming languages and version control software. Major emphasis is placed on a pragmatic understanding of core principles of programming and packaged implementations of methods. Students will leave the course with basic computational skills implemented through many computational methods and approaches to data science; while students will not become expert programmers, they will gain the knowledge of how to adapt and expand these skills as they are presented with new questions, methods, and data.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5100": {
        "Title": "Visual Data Analytics for the Web",
        "Course Code": "INFO5100",
        "Description": "\n            This course will cover technologies for representing, modeling and displaying data in the context of interactive web pages. Practical skills for building web pages will be mixed with data mining algorithms and visualization design theory. We will use the D3 Javascript library to develop both static and dynamic visualizations, learn more about programming in Javascript, and explore web scalable vector graphics (SVG). Through design critique and formal study, we will identify the techniques visualization developers employ to create the \"right\" visualization for a given use case.\n        ",
        "Combined Course": [
            "CS3300",
            "INFO3300"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: graduate students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Application required. See https://forms.gle/ZU1RJdQkrqYW4BBdA to apply. Upon approval, students are responsible for enrolling themselves with a permission number.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5125": {
        "Title": "Project Management",
        "Course Code": "INFO5125",
        "Description": "\n            This introductory course will emphasize the interpersonal skills necessary by project teams to manage demanding industry projects. Through a semester long simulated IS project, students will develop and apply a range of skills including time management, effective conflict resolution, negotiation, risk management, change control, and appropriate goal setting to adequately manage and execute their projects. Students will work in teams to engage in the 5 phases of the project management life cycle which includes: project initiation, planning, execution, monitoring, and project closure.\n        ",
        "Combined Course": [
            "INFO4125"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Information Science Master of Professional Studies (MPS) students.\n",
        "Need Note": false
    },
    "INFO5145": {
        "Title": "Privacy and Security in the Data Economy",
        "Course Code": "INFO5145",
        "Description": "\n            Increasingly, social and economic interactions are mediated by online platforms and algorithmic systems that rely on ubiquitous connectivity and data accumulation for their operation. While these systems have brought an unprecedented number of new products and services that have fostered growth and innovation, they have also created novel challenges to privacy and data security. In this course, we explore privacy and data security as multi-faceted concepts with economic, legal, social, ethical, and psychological underpinnings.\n        ",
        "Combined Course": [
            "INFO4145"
        ],
        "Semester Offered": [
            "FA24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5235": {
        "Title": "Sustainable Urban and Energy Delivery Systems",
        "Course Code": "INFO5235",
        "Description": "\n            The course focuses on how to transition from legacy energy delivery infrastructures dependent on fossil fuel to a sustainable decarbonized grid that harnesses distributed renewable energy resources and responsive demand from buildings, electrified transportation systems, and industrial loads. The content includes models and abstractions for the architecture of the cyber-physical energy system, its economics, and future evolution, and numerical optimization and learning methods in support of the infrastructure's safety critical operations in the legacy system and in the future architecture. At the MSc level the students will focus on learning how to use tools and data while at the graduate level the students will be asked to also solve problems, formulate novel solutions, interpret results. Similarly, to differentiate the MSc from PhD level and course outcomes, the final project will require the MSc students to pick one out of a set of predefined problems while the PhD students will have to define an original problem and solution.\n        ",
        "Combined Course": [
            "ECE5235"
        ],
        "Semester Offered": [
            "FA24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5240": {
        "Title": "Designing Technology for Social Impact",
        "Course Code": "INFO5240",
        "Description": "\n            The social impact of technologies is typically thought about fairly late, if ever, in the design process. Indeed, it can be difficult at design time to predict what effects technologies will have. Nevertheless, design decisions can inadvertently \"lock in\" particular values early on. In this course, we will draw on science & technology studies, technology design, and the arts to analyze the values embodied in technology design and to design technologies to promote positive social impact. What social and cultural values do technology designs consciously or unconsciously promote? To what degree can social impact be \"built into\" a technology? How can we take social and cultural values into account in design?\n        ",
        "Combined Course": [
            "INFO4240",
            "STS4240"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Technical background is not needed for this course.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5301": {
        "Title": "Ethics in New Media, Technology, and Communication",
        "Course Code": "INFO5301",
        "Description": "\n            This course examines moral and ethical issues in communication, new media, and technology. Using theories and research in moral philosophy and psychology, we examine how people perceive and reason about ethical issues presented by media and technology, and how moral action is influenced by cognitive, emotional, and ethical belief systems. Issues of autonomy, transparency, harm, privacy, manipulation, justice, democracy, equality, and care are discussed. We analyze the consistency between personal and professional ethics, the importance of moral character and agency, and the translation of moral thought to ethical action, and address the development of professional and personal ethical codes of conduct and research for communication professionals in the areas of new media and technology.\n        ",
        "Combined Course": [
            "COMM4300",
            "COMM5300",
            "INFO4301"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: graduate students and seniors, others by permission of department as space allows.\n",
        "Need Note": false
    },
    "INFO5303": {
        "Title": "Privacy in the Digital Age",
        "Course Code": "INFO5303",
        "Description": "\n            This course introduces students to privacy technologies and surveys the current state of digital privacy from multiple perspectives, including technology, law, policy, ethics, economics, and surveillance.\n        ",
        "Combined Course": [
            "CS5436"
        ],
        "Semester Offered": [
            "FA24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5310": {
        "Title": "Psychological and Social Aspects of Technology",
        "Course Code": "INFO5310",
        "Description": "\n            This course explores the psychological and sociological foundations of communication and information technology. The course focuses on the theories from the cognitive, behavioral and social sciences that play a role in understanding people's use of, access to and interactions with information and communication technologies. The course will examine multiple levels of analysis – individual, social, and social systems/communities – and present multiple disciplinary perspectives. The course will also provide a high-level view of methodologies used in the behavioral and social sciences.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5340": {
        "Title": "Virtual and Augmented Reality",
        "Course Code": "INFO5340",
        "Description": "\n            This course presents an introduction to virtual and augmented reality technologies, with focus on fundamental principles from 3D math, human perception, graphics, and interaction. Concepts from the contributing fields of computer vision, computer graphics and human computer interaction will be introduced in the context of virtual and augmented reality. Students will be tasked with creating their own virtual or augmented reality application as a course project.\n        ",
        "Combined Course": [
            "CS5650"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "MATH2210",
                "MATH2230",
                "MATH2310",
                "MATH2940"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: intermediate programming ability in C# or other object-oriented lagnuages. Familiarity with 3D game engines or strong desire to learn. Basic linear algebra.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": true
    },
    "INFO5355": {
        "Title": "Human Computer Interaction Design",
        "Course Code": "INFO5355",
        "Description": "\n            This course focuses on user experience design (UX) and the life cycle of interface design from the user perspective. We will discuss key aspects of the human-centered design process: understanding, analyzing, and formalizing user needs, exploring possible design solutions to address user needs, creating prototypes to externalize design ideas, and evaluating the usability of these prototypes. \n \n        ",
        "Combined Course": [
            "COMM3450",
            "INFO3450"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA23",
            "SP23",
            "FA22",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5356": {
        "Title": "Introduction to Human-Robot Interaction",
        "Course Code": "INFO5356",
        "Description": "\n            Robots are making their way into our everyday lives, working across several applications including in people's home, healthcare, and retail settings. As these systems become more integrated into our lives, it is important that they are designed to be useful, functional, and socially acceptable; however, this remains a key challenge for the field of human-robot interaction (HRI). This is a project-based course that covers core computational, engineering, and social challenges and approaches for effective HRI in human-centered environments. Topics include perception of people, computational HRI, design in HRI, coordination and collaboration, and experimental robotics. Students should expect to learn about seminal research in HRI, gain hands-on experience with physical mobile robots, and implement systems for real-time interaction with users.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5360": {
        "Title": "Healthcare Organization and Delivery",
        "Course Code": "INFO5360",
        "Description": "\n            The goal of this course is to educate students about the complexity and nuances of healthcare delivery. The course will be especially useful for non-clinicians who intend to go into fields that will require a detailed understanding of healthcare. Class sessions will analyze healthcare, so that students learn to identify tensions in healthcare and opportunities for improvement. Students will come away from the course with a deeper appreciation of why it is difficult to change healthcare. They will then be able to anticipate the intended and unintended consequences of interventions and policies that they and others might implement.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            2.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech Students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Corequisite for Health Tech Cornell Tech students: TECH 5999 as part of the Weill Cornell Clinics. More information on the Clinics will be provided by the Faculty at a later time.\n",
        "Need Note": false
    },
    "INFO5370": {
        "Title": "Applied Data Science: Decision-Making Beyond Prediction",
        "Course Code": "INFO5370",
        "Description": "\n            This course considers the data science challenges beyond training an accurate predictive model, especially for systems about people (data of behavior), and for people (deployed models to influence behavior). Whether for online marketplaces, transportation, governmental, or urban systems, effective data science in such settings requires dealing with user incentives and strategic behavior, networked and decentralized decision-making, and privacy and ethics concerns. Primary evaluation will be through programming based assignments (in Python) and conceptual questions.\n        ",
        "Combined Course": [
            "ORIE5355"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Recommended prerequisite: ENGRD 2700, CS 1380, or equivalent, and experience programming in Python. Recommended corequisite: INFO 5430 or CS 5785.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5410": {
        "Title": "Urban Systems",
        "Course Code": "INFO5410",
        "Description": "\n            Social scientists such as sociologists, economists, and anthropologists, as well as policymakers seek to better understand cities, in order to answer important theoretical questions, such as: what is a city in the first place; how does a city grow; what is a better city (and who is it better for); and (how) can we create and/or develop better cities. This course provides an integrative introduction to these disciplinary perspectives on cities so students acquire an overview of the key systems, processes, and technologies that must be managed, operated, and maintained in any urban center. The goal of the class is to unpack the complex interplay among institutions, markets, and citizens in the context of the financial, political, administrative, and legal policies that exist in urban communities so that students can understand urban systems in a holistic manner. We will deploy the lenses of three defining cornerstones of urban environments - institutions; real estate; and mass transit - to examine the management of cities and conflicts that arise within them, the design and use of public spaces and infrastructure, and the relationship between the public and the private spheres. The course pedagogy is a mix of participatory learning in the classroom and field visits/labs and expert lectures. The course will equip students with the conceptual and analytical tools necessary to ensure equitable, sustainable, and financially and politically viable approaches to urban challenges. It is primarily designed for students interested in working for a city, or in starting, working at, advising, or financing for-profit or not-for-profit ventures operating in the urban technology and innovation space.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech Urban Tech students during pre-enrollment. For all other Cornell Tech Students, please inquire with the faculty for instructor permission.\n",
        "Need Note": false
    },
    "INFO5430": {
        "Title": "Urban Data",
        "Course Code": "INFO5430",
        "Description": "\n            This course provides a broad overview of the opportunities and challenges related to urban data and helps familiarize students with key datasets and the tools and methodologies to visualize and analyze them.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO5410"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 5410.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO5431": {
        "Title": "Teams and Technology",
        "Course Code": "INFO5431",
        "Description": "\n            This course is designed to provide students with an understanding of research, design, and management of teams whose work and interactions are influenced by technology. Key questions that are addressed include: How does technology influence teamwork? How do we design technology to support teamwork? How do we build effective teams and team interactions for teams that work face to face or online? To address these questions the course will draw primarily from literature in organizational behavior, social psychology, design and human computer interaction. Group exercises will be used to actively build teamwork and team-leadership skills. Topics will include group effectiveness, human robot teamwork, group composition, computer supported collaboration, conflict, group dynamics, temporal issues in groups, geographically distributed teams, and measurement issues of group dynamics and performance.\n        ",
        "Combined Course": [
            "INFO4430"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5505": {
        "Title": "Computing and Global Development",
        "Course Code": "INFO5505",
        "Description": "\n            To date, most computing technologies have primarily benefited urban, affluent, and literate people in developed regions by empowering them with more information, resources, and agency. These technologies currently exclude billions of people worldwide, such as rural residents, people with disabilities, and indigenous communities, who are too poor to afford modern devices, too remote to be connected, or too low-literate to navigate the mostly text-driven Internet. In recent years, researchers and practitioners have examined how computing technologies can be designed or appropriated to empower such underserved communities. This course introduces students to the field of Information and Communication Technologies and Development (ICTD). Through discussions of case studies from the Global South, students will study how computing technologies are used in different global development domains, such as agriculture, finance, health, social justice, and education. They will gain understanding of socio-economic, cultural, and political forces that impact technology adoption in low-resource environments and will learn to design, build, and evaluate inclusive technologies to empower marginalized people.​\n        ",
        "Combined Course": [
            "INFO4505"
        ],
        "Semester Offered": [
            "FA24",
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5556": {
        "Title": "Business Intelligence Systems",
        "Course Code": "INFO5556",
        "Description": "\n            This course covers the fundamental technical and organizational concepts and challenges related to the development of Business Intelligence Systems, a key component crucial to the competitiveness of a wide range of organizations. Topics covered include: data profiling, dimensional data modeling, data transformation, metadata systems, data governance, data delivery options, and an overview of emerging technologies in this space. Course is comprised of interactive lectures, work/lab sessions, and a substantial team project.\n        ",
        "Combined Course": [
            "INFO4555"
        ],
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Information Science Master of Professional Studies (MPS) students. All others must add themselves to the waitlist during add/drop.\n                  For Bowers Computer and Information Science (CIS) Course Enrollment Help, please see: https://tdx.cornell.edu/TDClient/193/Portal/Home/\n",
        "Need Note": false
    },
    "INFO5600": {
        "Title": "AI for Healthcare",
        "Course Code": "INFO5600",
        "Description": "\n            With the rise in the availability of clinical and behavioral data in the world, artificial intelligence (AI) is now increasingly applied in the field of healthcare. Researchers are working on using AI in different spheres of the healthcare process ranging from understanding of the human behavior, early diagnoses of medical conditions and even recommendations for personalized treatment procedures. Physicians are using machine learning algorithms on clinical images for early detection of cancer. Researchers have shown that smartphone sensor data can be used to detect events like opioid overdose and enable just-in-time interventions to save lives. Psychologists are mining data from social networks to detect mental health conditions. This project based course will introduce the students to these next generation AI based healthcare systems and will focus on the design and implementation of these systems for the real world.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: basic knowledge of machine learning, deep learning techniques and coding experience.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": true
    },
    "INFO5910": {
        "Title": "Revolutionary Technologies",
        "Course Code": "INFO5910",
        "Description": "\n            The goal of this course is to help students deepen their theoretical and historical perspective on social change and the relationship between social change and technology. We will read a range of revolutionary thinkers including, but not limited to, Karl Marx, Friedrich Engels, Antonio Gramsci, Stuart Hall, Mahatma Gandhi, E.F. Schumacher and Frantz Fanon. We will study their theories of revolution and the underlying tensions within the division of labor in society, and discuss the role that technology can play in forming and reforming these social relations. We will use this as a lens to reflect both upon existing technology and the underlying relations that create and sustain it, as well as to envision new technological possibilities supported by (and supporting) alternative forms of human organization. Coursework will consist of significant reading, regular reading reflections, design exercises and a final course project.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA24",
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Enrollment limited to: Cornell Tech students.\n",
        "Need Note": false
    },
    "INFO1380": {
        "Title": "Data Science for All",
        "Course Code": "INFO1380",
        "Description": "\n            This course provides an introduction to data science using the statistical programming language R. We focus on building skills in inferential thinking and computational thinking, guided by the practical questions we seek to answer from data sets arising in medicine, economics and other social sciences. The course starts with essential R programming principles, and how to use R for data manipulation, visualization, and sampling. These techniques are then used to summarize and visualize real data sets, draw meaningful conclusions from those data, and assess the uncertainty surrounding those conclusions. Throughout the process, students will learn to develop hypotheses about their data, and use simulations and statistical techniques to test these hypotheses. The course also covers how to use the Tidyverse open-source R packages to clean and organize complex data sets, and create high quality graphics for data visualization.\n        ",
        "Combined Course": [
            "CS1380",
            "ORIE1380",
            "STSCI1380"
        ],
        "Semester Offered": [
            "SP24",
            "SP23",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "MQR-AS",
            "SDS-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Assumes basic high school mathematics. No calculus or programming experience required.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO2770": {
        "Title": "Excursions in Computational Sustainability",
        "Course Code": "INFO2770",
        "Description": "\n            Balancing environmental, economic, and societal needs for a sustainable future encompasses problems of unprecedented size and complexity. Computing and information science can play an important role in addressing critical sustainability challenges faced by present and future generations. The goal of the course is to introduce students to a range of sustainability challenges and to computational methods that can help address such challenges. Sustainability topics include sustainable development, biodiversity and wildlife conservation, poverty mitigation, food security, renewable resources, energy, transportation, and climate change. In the context of these sustainability topics, the course will introduce students to mathematical and computational modeling techniques, algorithms, and statistical methods. The course is at the introductory undergraduate level. Students are expected to have basic knowledge of probability theory and calculus.\n        ",
        "Combined Course": [
            "AEM2770",
            "CS2770"
        ],
        "Semester Offered": [
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SBA-AG"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students are expected to have basic knowledge of probability theory and calculus.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Prerequisites: Students are expected to have basic knowledge of probability theory and calculus.\n",
        "Need Note": false
    },
    "INFO3370": {
        "Title": "Studying Social Inequality Using Data Science",
        "Course Code": "INFO3370",
        "Description": "\n            Inequality is high in American society. Income and wealth are concentrated in far fewer hands than in other industrialized countries. Labor market outcomes are patterned by disparities across lines of race, gender, and class. This course will introduce social science theories about the origins of inequality, emphasizing how inequality is transmitted over time and across generations. Building on these theories, students will deploy tools for data science to visualize inequality, understand inequality, and evaluate hypothetical policy interventions that might reduce inequality. We will use the R programming language. A theme of the course is that applied work in this area can give rise to new data science tools, which may help solve some of society's most pressing challenges.\n        ",
        "Combined Course": [
            "INFO5371"
        ],
        "Semester Offered": [
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "SCD-AS"
        ],
        "Prerequisites": [
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4390": {
        "Title": "Practical Principles for Designing Fair Algorithms",
        "Course Code": "INFO4390",
        "Description": "\n            Algorithms increasingly guide high-stakes decision-making across many domains. This has potential upsides, since algorithms can improve decision-making, but also serious risks, since recent years have showcased the many ways that algorithms can be biased. This course will teach you principles for designing fair algorithms, emphasizing accessibility to a broad audience via practical takeaways which are directly relevant to the real world through case studies and guest speakers. Case studies will be drawn from diverse settings where algorithms are applied, such as large language models, speech recognition systems, healthcare, criminal justice, sustainability, and education. Students will come away with a strong understanding of how algorithm-related choices can have widespread societal impact.\n        ",
        "Combined Course": [
            "INFO5390"
        ],
        "Semester Offered": [
            "SP24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students should have experience coding in Python and have taken at least one introductory course in machine learning or data science.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5306": {
        "Title": "Crowdsourcing and Human Computation",
        "Course Code": "INFO5306",
        "Description": "\n            \"Crowdsourcing\" and \"human computation\" refer to various ways that computing has brought together human labor to achieve outcomes that were previously beyond our individual capabilities or expectations.  Wikipedia's millions of articles, the success of Linux and other open source software projects, citizen science, and the generation of large datasets for machine learning and artificial intelligence using \"microlabor\" are all examples of ways in which technology and people together have exceeded the capabilities of people or machines in isolation. This course will survey the state of the art in this area and give practical knowledge of the area, grounded in numerous examples in diverse settings.\n        ",
        "Combined Course": [
            "CS5306"
        ],
        "Semester Offered": [
            "SP24",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: advanced coursework in Computer Science.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "INFO5371": {
        "Title": "Studying Social Inequality Using Data Science",
        "Course Code": "INFO5371",
        "Description": "\n            Inequality is high in American society. Income and wealth are concentrated in far fewer hands than in other industrialized countries. Labor market outcomes are patterned by disparities across lines of race, gender, and class. This course will introduce social science theories about the origins of inequality, emphasizing how inequality is transmitted over time and across generations. Building on these theories, students will deploy tools for data science to visualize inequality, understand inequality, and evaluate hypothetical policy interventions that might reduce inequality. We will use the R programming language. A theme of the course is that applied work in this area can give rise to new data science tools, which may help solve some of society's most pressing challenges.\n        ",
        "Combined Course": [
            "INFO3370"
        ],
        "Semester Offered": [
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO2950"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 2950 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5380": {
        "Title": "Digital Fabrication: Manipulating the Matter of Tech",
        "Course Code": "INFO5380",
        "Description": "\n            Historically, computing encompassed one-dimensional Input/Output using command line interfaces. The GUI and mouse brought 2D I/O to computing, and later VR and 3D Scanning allowed for 3D I/O. The next thing is interacting with matter as I/O for computing: Digital Fabrication. This course teaches fabrication techniques, and how to leverage it to control physical matter. This will allow you to develop hardware or understand how to talk to hardware developers within your team. We will dive down to the bare bones of fabrication machines by creating custom slicers to control 3D printers using basic coding. We will take apart existing products to study how they were made and build entirely new products from scratch.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "SP24",
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC at Cornell Tech. Enrollment Limited to Cornell Tech Students.\n",
        "Need Note": false
    },
    "INFO5390": {
        "Title": "Practical Principles for Designing Fair Algorithms",
        "Course Code": "INFO5390",
        "Description": "\n            Algorithms increasingly guide high-stakes decision-making across many domains. This has potential upsides, since algorithms can improve decision-making, but also serious risks, since recent years have showcased the many ways that algorithms can be biased. This course will teach you principles for designing fair algorithms, emphasizing accessibility to a broad audience via practical takeaways which are directly relevant to the real world through case studies and guest speakers. Case studies will be drawn from diverse settings where algorithms are applied, such as large language models, speech recognition systems, healthcare, criminal justice, sustainability, and education. Students will come away with a strong understanding of how algorithm-related choices can have widespread societal impact.\n        ",
        "Combined Course": [
            "INFO4390"
        ],
        "Semester Offered": [
            "SP24"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students should have experience coding in Python and have taken at least one introductory course in machine learning or data science.",
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4350": {
        "Title": "Conversations and Information",
        "Course Code": "INFO4350",
        "Description": "\n            As conversations become central to the way in which we acquire and consume information and as the societal implications became evident (e.g., potential for misinformation, hate speech, ethical questions surrounding the use of chatbots), there is an increasing need for automated ways to analyze their quality.  This course will cover computational approaches to conversational analysis: starting from topics that were traditionally addressed within the Sociology subfield of Conversational Analysis, continuing with reviewing existing computational methods that address those topics, and further guiding the development of new methods and their application to real-life conversational data.  In addition to lecturing in-class activities will include close interaction with conversational data, such as collaborative annotation of conversational phenomen, in-depth discussion of hand-picked examples, as well as joint and iterative development of annotation guidelines that lend themselves for computational modeling. \n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisites: INFO 4300 or CS 4300, MATH 2940 or equivalent, CS 2800 or equivalent and CS 2110 or equivalent.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Permission of instructor is required.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Instructor permission required.\n",
        "Need Note": false
    },
    "INFO5345": {
        "Title": "Developing and Designing Interactive Devices",
        "Course Code": "INFO5345",
        "Description": "\n            This course covers the human-centered and technical workings behind interactive devices ranging from cell phones and video controllers to household appliances and smart cars. This is a hands-on, lab-based course. For the final project, students will build a functional IoT prototype of their own design, using Javascript, single-board Linux computer, embedded microcontrollers, and/or other electronic components. Topics include electronics prototyping, interface design, sensors and actuators, microcontroller development, physical prototyping, and user testing.\n        ",
        "Combined Course": [
            "CS5424",
            "ECE5413"
        ],
        "Semester Offered": [
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: basic programming experience.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC at Cornell Tech. Enrollment limited to Cornell Tech students only. A $240 course fee will be required.\n",
        "Need Note": true
    },
    "INFO5460": {
        "Title": "The Politics and Policy of Urban Sustainability",
        "Course Code": "INFO5460",
        "Description": "\n            Cities are increasingly recognized as a key level of government for environmental and sustainability policy. As at all levels, politics and policy are intensely intertwined, and perhaps moreso at the local level because the decisions involved often affect constituents directly and intimately -- in their neighborhoods, in their homes, in their commutes. This course explores both the politics and the policy of sustainability in the municipal context. Covering a range of sustainability issues -- such as air quality, public health, and transportation -- it looks at the dynamics of making change happen at the local level, including variations in power among municipal governments; how issues get defined and allocated; how stakeholder management takes place (or doesn't); how agencies and levels of government interfere with each other; and how best practices can (and cannot) be transferred internationally. The course is reading-intense and includes case studies by historians rather than political scientists. The focus of most readings is on the United States, but students' research projects will require looking beyond the US and transferring practices to a US city.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23",
            "FA22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC at Cornell Tech. Enrollment Limited to Cornell Tech Students Only.\n",
        "Need Note": false
    },
    "INFO5500": {
        "Title": "Health Tech Clinical Practicum",
        "Course Code": "INFO5500",
        "Description": "\n            This course is designed to give students hands on experience applying health tech tools and methods to real world clinical challenges. Students will work (individually or in pairs) with a clinical advisor to assess a particular clinical need for application of digital technology and based on that assessment students will develop a feasibility prototype. Through the implementation process, students will have the opportunity to shadow their clinical advisor in a clinical or research setting.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23",
            "SP23",
            "SP22"
        ],
        "Credits": [
            1.0,
            2.0,
            3.0,
            4.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": "Students must identify and obtain commitment from a clinical advisor and receive approval from the Program Director before registering.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Health Tech students at Cornell Tech. ",
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC at Cornell Tech. Enrollment Limited to Cornell Tech Health Tech Students only. Students registering for the class are expected to find clinical collaborators and project for approval by the instructor.\n",
        "Need Note": false
    },
    "INFO5555": {
        "Title": "Health Tech, Data, and Systems",
        "Course Code": "INFO5555",
        "Description": "\n            This course is a survey of the computing systems, technologies, and data sets used throughout the healthcare system--spanning provider, patient, payer, and pharma. Students will gain an understanding of the functional requirements and constraints placed on these digital systems and to provide a basis for future innovation.\n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23"
        ],
        "Credits": [
            2.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS2110",
                "CS4110"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: CS 2110 or CS 4110.",
        "Comments": "Students enrolling in 2 credits should assume moderate programming and data analysis skills at the level of CS 2110 or CS 4110.",
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC. Enrollment Limited to Cornell Tech Students only.\n",
        "Need Note": false
    },
    "INFO5610": {
        "Title": "Sensors, Systems and Algorithms for Precision Behavioral Health",
        "Course Code": "INFO5610",
        "Description": "\n            Precision Behavioral Health will introduce students to the sensors, computational systems and algorithms that will play a transformative role in the diagnosis, treatment, and management of mental and behavioral health. Recent computational advancements have repurposed ubiquitous technologies for passive and remote mental health measurement. These technologies have the potential to disrupt mental healthcare, giving clinicians more resources to manage patients' mental health and deliver care at lower cost. Yet, these technologies will also disrupt clinical workflows and data sharing norms, requiring frameworks for responsible use. Within this course, students will participate in seminar discussions and hands-on projects to learn about the ongoing advancements in multi-modal sensor fusion and AI algorithms for symptom measurement, technology-driven intervention, and the ethical implications of building these tools.\n \n        ",
        "Combined Course": null,
        "Semester Offered": [
            "FA23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS5785",
                "ECE5414",
                "ORIE5750"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: CS 5785 /ECE 5414 /ORIE 5750 or demonstrated foundational programing and machine learning knowledge.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC at Cornell Tech. Enrollment limited to Cornell Tech Students only.\n",
        "Need Note": true
    },
    "INFO2921": {
        "Title": "Inventing an Information Society",
        "Course Code": "INFO2921",
        "Description": "\n            Provides an introduction to the role computing and information technologies played in political public life, from tabulating machines used to calculate the census to Big Tech's impact on democratic procedures, the future of labor, and the environment. Though organized around four thematic units (Recognizing and Representing, Knowing, Working, and Belonging), the course pays attention to the chronological trajectory of technologies and political practices and students will develop the skills necessary for historical analysis. While focusing on the US experience the course also highlights the international flow of labor, materials, and ideas. By studying the development of computing historically, we will grapple with the effects of computing and data sciences on society today, paying special attention to critiques of economic, racial, and gender injustice. The course will meet twice a week, and each meeting will include a lecture followed by a discussion.\n        ",
        "Combined Course": [
            "AMST2980",
            "ENGRG2980",
            "HIST2920",
            "STS2921"
        ],
        "Semester Offered": [
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "HA-AG",
            "HA-AS",
            "HST-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          This course is restricted to INFO students. If you do not meet the enrollment criteria for the course, please add yourself to the waitlist. https://infosci.cornell.edu/courses/enrollmentwaitlist.\n",
        "Need Note": false
    },
    "INFO4210": {
        "Title": "Artificial Intelligence: Law, Ethics, and Politics",
        "Course Code": "INFO4210",
        "Description": "\n            In the coming decades machine intelligence will transform the economy, society, and global politics. This course will study these processes and the political challenges to the development of beneficial AI. Topics will include problems in AI safety; effects on- and of inequality and technological unemployment; the strategic and tactical impacts of autonomous weapons, cyberweapons, and AI-enabled intelligence operations; global institutions for providing global public goods, the legitimate aggregation of preferences, and the beneficial governance of AI development.\n        ",
        "Combined Course": [
            "PAM4210"
        ],
        "Semester Offered": [
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4561": {
        "Title": "Evaluation and Society",
        "Course Code": "INFO4561",
        "Description": "\n            Evaluation is a pervasive feature of contemporary life. Professors, doctors, countries, hotels, pollution, books, intelligence: there is hardly anything that is not subject to some form of review, rating, or ranking these days. This senior seminar examines the practices, cultures, and technologies of evaluation and asks how value is established, maintained, compared, subverted, resisted, and institutionalized in a range of different settings. Topics include user reviews, institutional audit, ranking and commensuration, algorithmic evaluation, tasting, gossip, and awards. Drawing on case studies from science, technology, culture, accounting, art, environment, and everyday life, we shall explore how evaluation comes to order our lives – and why it is so difficult to resist.\n        ",
        "Combined Course": [
            "SHUM4561",
            "SOC4560",
            "STS4561"
        ],
        "Semester Offered": [
            "SP23",
            "SP22"
        ],
        "Credits": [
            4.0
        ],
        "Distribution": [
            "SBA-AS",
            "SSC-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment preference given to: seniors, STS/BSOC majors.",
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5755": {
        "Title": "Mobile Human Robot Interaction Design",
        "Course Code": "INFO5755",
        "Description": "\n            Robot and automated systems often need to move in and around people. This technical and human-centered course surveys current physical, computation and sensing technologies that make mobile human robot interaction possible, and delves into key research problems in interaction, human modelling, and repair which are needed to tackle the grand challenge of mobile HRI. As part of this course, students will build working prototypes of mobile robots, and deploy them for study in human environments. The 5000-level version of this course focuses on platform development; the 6000-level version of this course focuses on the production of human participant research studies using mobile HRI.\n        ",
        "Combined Course": [
            "CS5755",
            "CS6755",
            "INFO6755"
        ],
        "Semester Offered": [
            "SP23"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "CS1110",
                "CS1112",
                "CS1133"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: proficiency in Python.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": "Permission Note Enrollment limited to: Cornell Tech students.",
        "Foot Note": "\nInstruction Mode: In Person\n                          Taught in NYC. Enrollment limited to Cornell Tech students.\n",
        "Need Note": true
    },
    "INFO2750": {
        "Title": "Robot Ethics",
        "Course Code": "INFO2750",
        "Description": "\n            Covers the ethics of intelligent autonomous systems. Fulfills liberal studies credit – is not an ECE technical elective. As technologies and algorithms that can autonomously take in information, make decisions, and act on those decisions become more and more prevalent, questions arise as to the moral and ethical aspects of their use. What are the philosophical foundations for a new Robot Ethics? Topics covered include social and therapeutic robotics, search and rescue, surveillance, military decision making, financial markets, social media, robot artists, robot scientists, automation, medical robotics, and policing, among others.\n        ",
        "Combined Course": [
            "ECE2750",
            "ENGRG2750",
            "STS2751"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AS",
            "ETM-AS"
        ],
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4200": {
        "Title": "Information Policy: Applied Research and Analysis",
        "Course Code": "INFO4200",
        "Description": "\n            This course will address a wide range of information policy issues such as privacy, security, antitrust, intellectual property, algorithmic fairness, net neutrality, risk mitigation strategies, and other legal and policy compliance concerns in a simulated project management environment. Patterned on life cycle project management for products and services in contemporary large-scale technology companies, students will adopt specific topic areas for applied research and analysis working dynamically with other team members. Course outcomes include conducting upper-level research in specific information policy domains, experiential group dynamics, persuasive analytic presentations, fundamentals of project management in the technology sector, and insights into corporate hierarchies, organization, and functionalities.\n        ",
        "Combined Course": [
            "COMM4201",
            "INFO5200",
            "STS4200"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "INFO1200",
                "INFO1260"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: INFO 1200 or INFO 1260, or permission of instructor.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": true
    },
    "INFO4490": {
        "Title": "Social Behavior and Technology",
        "Course Code": "INFO4490",
        "Description": "\n            This course explores personal connections in the digital age, and how information and communication technologies impact our lives and relationships. It focuses on how people manage interactions and identities, develop and maintain relationships, accomplish social goals, create shared meanings, and engage in collaboration and conflict in social media. Emphasis will be placed on how current thinking in relational communication can explain and anticipate interpersonal dynamics on the Internet, but also on how online behaviors may challenge traditional principles of human communication. A major part of the course is a semester-long research project in which students working in small groups design, run, and present their own empirical study of personal relationships and technology.\n        ",
        "Combined Course": [
            "COMM4490",
            "COMM6490",
            "INFO6490"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM2820",
                "COMM2450",
                "INFO2450"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2820 or COMM 2450 or INFO 2450.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO4800": {
        "Title": "Behavioral Science Interventions",
        "Course Code": "INFO4800",
        "Description": "\n            \"There is nothing as practical as a good theory,\" Kurt Lewin wrote. Today behavioral scientists build on social scientific theories about human behavior to develop new intervention approaches that address major challenges facing our society: poverty, poor health, educational inequalities, and many more. This course is designed as a senior capstone seminar that equips students with the knowledge and skills to analyze social problems, consider the ethical implications of intervention, design and pilot appropriate interventions, implement and test them online, analyze and interpret the results, and present policy-relevant findings. The course combines applied quantitative research methods and applied social behavioral science theories to prepare students for careers in research, data science, consulting, and policy evaluation.\n        ",
        "Combined Course": [
            "COMM4800",
            "COMM5800",
            "INFO5800"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": [
            "KCM-AG",
            "SBA-AG",
            "SBA-AS",
            "SSC-AS"
        ],
        "Prerequisites": [
            [
                "COMM2760",
                "INFO2450",
                "PSYCH2800"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2760 or INFO 2450 or PSYCH 2800 or approved introductory social science theory course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n                          Students need to submit an application to be enrolled into the class. The application form for Spring 2022 can be found here: https://cornell.ca1.qualtrics.com/jfe/form/SV_bDUr0KcN2D8DjcV. Those who are selected will receive a permission code from the instructor to add the course in Student Center. Please contact Professor Kizilcec (kizilcec@cornell.edu) for any questions.\n",
        "Need Note": false
    },
    "INFO5200": {
        "Title": "Information Policy: Applied Research and Analysis",
        "Course Code": "INFO5200",
        "Description": "\n            This course will address a wide range of information policy issues such as privacy, security, antitrust, intellectual property, algorithmic fairness, net neutrality, risk mitigation strategies, and other legal and policy compliance concerns in a simulated project management environment. Patterned on life cycle project management for products and services in contemporary large-scale technology companies, students will adopt specific topic areas for applied research and analysis working dynamically with other team members. Course outcomes include conducting upper-level research in specific information policy domains, experiential group dynamics, persuasive analytic presentations, fundamentals of project management in the technology sector, and insights into corporate hierarchies, organization, and functionalities.\n        ",
        "Combined Course": [
            "COMM4201",
            "INFO4200",
            "STS4200"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": null,
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    },
    "INFO5800": {
        "Title": "Behavioral Science Interventions",
        "Course Code": "INFO5800",
        "Description": "\n            \"There is nothing as practical as a good theory,\" Kurt Lewin wrote. Today behavioral scientists build on social scientific theories about human behavior to develop new intervention approaches that address major challenges facing our society: poverty, poor health, educational inequalities, and many more. This course is designed as a senior capstone seminar that equips students with the knowledge and skills to analyze social problems, consider the ethical implications of intervention, design and pilot appropriate interventions, implement and test them online, analyze and interpret the results, and present policy-relevant findings. The course combines applied quantitative research methods and applied social behavioral science theories to prepare students for careers in research, data science, consulting, and policy evaluation.\n        ",
        "Combined Course": [
            "COMM4800",
            "COMM5800",
            "INFO4800"
        ],
        "Semester Offered": [
            "SP22"
        ],
        "Credits": [
            3.0
        ],
        "Distribution": null,
        "Prerequisites": [
            [
                "COMM2760",
                "INFO2450",
                "PSYCH2800"
            ]
        ],
        "Corequisites": [],
        "Prerequisites or Corequisites": [],
        "Specific Requirements": "Prerequisite: COMM 2760 or INFO 2450 or PSYCH 2800 or approved introductory social science theory course.",
        "Comments": null,
        "Recommended Prerequisite": null,
        "Permission": null,
        "Foot Note": "\nInstruction Mode: In Person\n",
        "Need Note": false
    }
}